davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<description>Returns the status of the main battery temperature comparator. This comparator by default checks if the battery temperature is in the Cold zone. However, if JEITA support is enabled and battery temperature is found to not be in either the Hot or the Cold zone, the same comparator is used to check for the Warm and Cool zones, as JEITA suggests.
The specific bit-field is suggested to be used in bypass mode and when the JEITA support is disabled (so when the battery temperature is checked agains the Hot and the Cold zones). In that case, the comparator checks the battery temperature agains the Cold level and its status can be as follows:
0 = Battery temperature pack is found to be below the Cold level, so in the non-allowed Cold temperature zone. Thus, charging will be disabled, provided that the NTC_LOW_DISABLE bit-field of CHARGER_CTRL_REG is not set.
1 = Battery temperature pack is found to be above the non-allowed Cold temperature zone. Thus, charging will be continued, provided that battery temperature will not be in the Hot zone as well.
When the Charger's main FSM is active and JEITA is enabled, the Charger's digital block takes over and controls the respective comparator's output.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_HOT_COMP_OUT</name>
	<description>Returns the status of the battery temperature comparator dedicated to the Hot temperature zone.
0 = Battery temperature pack is found to be below the Hot zone
1 = Battery temperature pack is found to be in the non-allowed Hot temperature zone. Thus, charging will be disabled, provided that battery temperature protection is enabled.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDIE_COMP_OUT</name>
	<description>0 = Die temperature is found to be below the programmed level, set in CHARGER_TEMPSET_PARAM_REG.TDIE_SET level (normal operation)
1 = Die temperature is found to be above the set level.
Charging will be disabled if Die temperature protection is enabled and the Die temperature is found to be above the set level four consecutive times (see also TDIE_ERROR_DEBOUNCE_CNT bit-field). In that case, the Charger's FSM will also move the respective error state (TDIE_PROT) and an IRQ may be generated, if the respective mask bit of CHARGER_ERROR_IRQ_MASK_REG is set.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBAT_OVP_COMP_OUT</name>
	<description>0 = Vbat has not exceeded the Over-Voltage Protection (OVP) voltage limit, according to the respective analogue comparator's output.
1 = Vbat is found to have exceeded the OVP voltage setting, thus charging should be disabled.
The OVP voltage settings are defined in CHARGER_VOLTAGE_PARAM_REG.V_OVP (for the Normal battery temperature zone), as well as in CHARGER_JEITA_V_OVP_REG (for Cool and Warm temperature zones, to comply with JEITA). </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAIN_VBAT_COMP_OUT</name>
	<description>This bit-field reflects the status of the main Vbat comparator residing in the analogue circuitry of the Charger.
This comparator is used to check Vbat against either the Pre-Charge or the Replenish voltage level, depending on what is driven by the Charger's digital block.
Thus, when the FSM is active, the comparator gets as reference the Replenish setting as soon as the FSM has reached the END_OF_CHARGE state. Otherwise,the Pre-Charge voltage setting is driven, including the Bypass mode.
According to the above, the encoding is as follows for the case the comparator compares Vbat against the Pre-Charge level:
0 = Vbat has not exceeded the set Pre-Charge voltage level.
1 = Vbat has reached or exceeded the set Pre-Charge voltage level.
For the case the comparator compares agains the Replenish level (when the FSM has reached the END_OF_CHARGE state, so when the charging has been completed), the encoding is as follows:
0 = Vbat has dropped below the set Replenish level, so charging will re-start and the FSM will move to the PRE_CHARGE state.
1 = Vbat is still greater or equal to the set Replenish level, thus charging remains in hold and the FSM in END_OF_CHARGE state.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>END_OF_CHARGE</name>
	<description>0 = Actual charge current is above the current level programmed in I_END_OF_CHARGE field of CHARGER_CURRENT_PARAM_REG (or charger is off)
1 = Actual charge current is below the current level programmed in I_END_OF_CHARGE bit-field of CHARGER_CURRENT_PARAM_REG.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_CV_MODE</name>
	<description>0 = Charger's voltage loop not in regulation (or Charger is off)
1 = Charger's Constant Voltage (CV) mode active, voltage loop in regulation</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_CC_MODE</name>
	<description>0 = Charger's Current loop not in regulation (or Charger is off)
1 = Charger's Constant Current (CC) mode active, current loop in regulation</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_IS_POWERED_UP</name>
	<description>0 = Charger is either off or it is being powered-on but the analogue ciruitry is not yet settled. The charger's main FSM is either in POWER_UP or INIT states.
1 = Charger is powered-up, so its analogue ciruitry should now be settled. The Charger's FSM has left both power-up states (POWER_UP, INIT), so charging can start.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_SWLOCK_REG</name>
	<description>Charger SW lock register</description>
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>SWLOCK_FSM_STATE</name>
	<description>Returns the state of the FSM detecting the sequence of writes that either enable (lock) or disable (un-lock) the protection to the Charger registers/register bit-fields, protected also through CHARGER_LOCK_REG (bits [14:0]). The supported states are:
  - WORD0 : First write expected, either when the SW protection is active (SWLOCK_STATUS = 1) or inactive (0).
  - WORD1 : Second write expected. If the data written is the proper one, the FSM continues to WORD2 state, otherwise it starts over from state WORD0.
  - WORD2 : Third and last write expected. In this state, the FSM expects the proper write to toggle the SWLOCK_STATUS bit and switches from lock (default) to un-lock state and vice-versa. From WORD2, the FSM always switches to WORD0.
The lock and un-lock data sequences that must be written to this register are provided right below, for the sake of completeness.
  - LOCK sequence: 0x3768, 0x8673, 0xDEAD
  - UNLOCK sequence: 0x756E (&quot;un&quot;), 0x6C6F (&quot;lo&quot;), 0x636B (&quot;ck&quot;)
It is noted that locking is effective only if bit [15] of CHARGER_LOCK_REG is set to 1. Otherwise, even if the sequence of data written by SW is the proper one, the locking through this mechanism will not be achieved and the registers will be protected or not depending on the state of the respective bits ([14:0]) of CHARGER_LOCK_REG.</description>
	<bitRange>[2:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SWLOCK_STATUS</name>
	<description>0 = SW locking is not active, writes to the protected Charger registers are allowed depending on CHARGER_LOCK_REG (bits [14:0])
1 = SW locking will be activated as soon as the (set-only) bit [15] of CHARGER_LOCK_REG is set. In that case, writes are not allowed to all the protected* Charger registers and register bit-fields, regardless of the bits [14:0] of CHARGER_LOCK_REG.
The specific bit becomes 1 only if the SW locking sequence of writes to this register is applied (see also SWLOCK_FSM_STATE bit-field for the lock/un-lock sequences). It can be unset only if the SW un-lock write sequence is applied.
*Note: The protected Charger registers covered by the SW lock/un-lock mechanism are the ones protected also by the bits [14:0] of CHARGER_LOCK_REG, and which are mentioned in the register descriptions of the respective bit-fields.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_TBAT_COMP_TIMER_REG</name>
	<description>Battery temperature (main) comparator timer register</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>TBAT_COMP_TIMER</name>
	<description>Returns the main battery temperature comparator's timer, used for the latching of the comparator's output. The output of the comparator is used by the JEITA FSM, to determine the current battery temperature pack's status.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_COMP_SETTLING</name>
	<description>Settling time (specified in us) for the main battery temperature comparator, checking for the &quot;COOL&quot;, &quot;COLD&quot; and &quot;WARM&quot; levels. The charger's digital block uses a dedicated timer to sample the specific comparator's output. The comparator's output is latched as soon as the timer expires, reaching 0. Then, the timer is reloaded with the settling time value and starts-over, down-counting to 0.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_TBAT_MON_TIMER_REG</name>
	<description>Battery temperature monitor interval timer register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>TBAT_MON_TIMER</name>
	<description>This is the battery temperature monitoring timer, counting with the Charger's 1-kHz clock. If the battery monitor mode is accordingly set in the TBAT_MONITOR_MODE bit-field of CHARGER_CTRL_REG (so either to 0x1 or 0x2), this timer is initially loaded with the value set in TBAT_MON_INTERVAL bit-field in the subsequent 1-kHz cycles starts down-counting to 0. As soon as the specific timer expires,the JEITA FSM starts-over again, to refresh the battery temperature status.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_MON_INTERVAL</name>
	<description>Timing interval (in ms) for the Battery temperature monitoring. This interval determines how often the JEITA FSM will be checking and potentially refreshing the Battery temperature status, by selecting accordingly the proper level (Hot, Cold, Warm, Cool or Normal), based on the feedback of the two battery temperature comparators being present in the Charger's analogue circuitry (one for the Hot level and one for Cold, Cool and Warm, to support JEITA).
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_TDIE_COMP_TIMER_REG</name>
	<description>Die temperature comparator timer register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>TDIE_COMP_TIMER</name>
	<description>Returns the current value of the timer used to determine when the Die temperature comparator's output must be sampled by the digital. As soon as the timer expires (down-counting to 0, starting from TDIE_COMP_SETTLING) the comparator's output is latched by the Charger's digital block and used by the main FSM. After expiring, the timer starts-over again, down-counting, to enable the continuous monitoring of Die temperature by the digital.
Note: When the Charger's FSM is in BYPASSED state, this timer is kept to zero and the SW takes over, sampling the status of the TDIE_PROT_COMP_OUT bit-field of CHARGER_STATUS_REG to determine if the Die temperature limit has been exceeded.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDIE_COMP_SETTLING</name>
	<description>Settling time threshold (in us) for the Die temperature comparator. </description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_TEMPSET2_PARAM_REG</name>
	<description>Charger battery temperature settings register (Cooler, Warmer).</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00dde654</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>TBAT_WARMER</name>
	<description>This bit-field determines the battery temperature threshold above which the &quot;WARMER&quot; zone is defined (between WARM and HOT).
The temperature range is the same with the one defined in the description of CHARGER_TEMPSET_PARAM_REG[TBAT_COLD] bit-field.</description>
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_WARM</name>
	<description>This bit-field determines the battery temperature above which the charge current is reduced, defining the &quot;WARM&quot; temperature zone.
The temperature range is the same with the one defined in the description of CHARGER_TEMPSET_PARAM_REG[TBAT_COLD] bit-field.</description>
	<bitRange>[17:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_COOL</name>
	<description>This bit-field determines the battery temperature below which the charge current is reduced, defining the &quot;COOL&quot; temperature zone.
The temperature range is the same with the one defined in the description of CHARGER_TEMPSET_PARAM_REG[TBAT_COLD] bit-field.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_COOLER</name>
	<description>This bit-field determines the battery temperature below which the charge current is reduced, defining the &quot;COOLER&quot; temperature zone (between COLD and COOL).
The temperature range is the same with the one defined in the description of CHARGER_TEMPSET_PARAM_REG[TBAT_COLD] bit-field.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_TEMPSET_PARAM_REG</name>
	<description>Charger battery temperature settings register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00003fca</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>TDIE_MAX</name>
	<description>This bit-field determines the maximum Die temperature level limit, ranging from 0 &#176;C to 130 &#176;C, according to the following encoding:
000: 0 &#176;C (for test purpose only)
001: 50 &#176;C
010: 80 &#176;C
011: 90 &#176;C
100: 100 &#176;C
101: 110 &#176;C
110: 120 &#176;C (for test purpose only)
111: 130 &#176;C (for test purpose only)</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_HOT</name>
	<description>This bit-field determines the battery temperature above which the charge current is zero, defining the &quot;Hot&quot; battery temperature zone. The range is the same with the one defined in the description of TBAT_COLD bit-field.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_COLD</name>
	<description>This bit-field determines the battery temperature below which the charge current is zero, defining the &quot;Cold&quot; zone. The covered temperatures range is provided in the following list, which also includes the &quot;Comparator Ladder Reference&quot; ratio. Note: the specific range has been computed using an external 12 kW resistor.
0:   -5C/0.741
1:   -4C/0.733
2:   -3C/0.724
3:   -2C/0.715
4:   -1C/0.706
5:    0C/0.695
6:    1C/0.686
7:    2C/0.677
8:    3C/0.668
9   :    4C/0.657
10 :    5C/0.647
11 :    6C/0.638
12 :    7C/0.628
13 :    8C/0.618
14 :    9C/0.608
15 :   10C/0.596
16 :   11C/0.587
17 :   12C/0.578
18 :   13C/0.567
19 :   14C/0.557 
20 :   16C/0.546
21 :   17C/0.536
22 :   18C/0.527
23 :   19C/0.517
24 :   20C/0.506
25 :   21C/0.495
26 :   22C/0.486
27 :   23C/0.477
28 :   24C/0.467
29 :   25C/0.457
30 :   26C/0.446
31 :   27C/0.438
32 :   28C/0.429
33 :   29C/0.419
34 :   30C/0.410
35 :   31C/0.400
36 :   32C/0.392
37 :   33C/0.383
38 :   34C/0.375
39 :   35C/0.366
40 :   36C/0.356
41 :   37C/0.349
42 :   38C/0.341
43 :   39C/0.333
44 :   40C/0.325
45 :   41C/0.316
46 :   42C/0.309
47 :   43C/0.302
48 :   44C/0.295
49 :   46C/0.287
50 :   47C/0.280
51 :   48C/0.273
52 :   49C/0.267
53 :   50C/0.260
54 :   51C/0.253
55 :   52C/0.247
56 :   53C/0.241
57 :   54C/0.235
58 :   55C/0.229
59 :   56C/0.223
60 :   57C/0.217
61 :   58C/0.212
62 :   59C/0.207
63 :   60C/0.202</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_THOT_COMP_TIMER_REG</name>
	<description>Battery temperature comparator timer register for &quot;Hot&quot; zone</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>THOT_COMP_TIMER</name>
	<description>Returns the battery temperature comparator's timer dedicated for the &quot;Hot&quot; level.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>THOT_COMP_SETTLING</name>
	<description>Charger's battery temperature comparator settling time (specified in us), specifically for the Hot temperature zone. The charger's digital block uses a dedicated timer to sample the specific comparator's output. The comparator's output is latched as soon as the timer expires, reaching 0. Then, the timer is reloaded with the settling time value and starts-over again
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_TOTAL_CHARGE_TIMER_REG</name>
	<description>Maximum total charge time limit register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00003f48</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TOTAL_CHARGE_TIMER</name>
	<description>Returns the current value of the overall charge timeout counter, running at a 1-Hz clock. This timer has been set to 16 bits, so that it can count up to 10.5 hours, and ranges from 0 to MAX_TOTAL_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_TOTAL_CHARGE_TIME</name>
	<description>This bit-field determines the maximum overall charging time allowed (measured in ticks of the 1-Hz clock). If this is exceeded, a total charge time-out error will be captured by the Charger's controller and its FSM will move to the ERROR state. An IRQ will be also generated if the respective IRQ mask bit of CHARGER_ERROR_IRQ_MASK_REG is already set. To exit this state, the &quot;CHARGER_RESUME&quot; bit-field of CHARGER_CTRL_REG must be set, to enable the Charger's FSM switch from ERROR to DISABLED state and start-over.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_VBAT_COMP_TIMER_REG</name>
	<description>Main Vbat comparator timer register</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>VBAT_COMP_TIMER</name>
	<description>Returns the current value of the timer used to determine when the output of the Vbat comparator (checking Vbat vs Pre_Charge and Replenish levels) must be sampled by the digital. As soon as the timer expires (down-counting to 0, starting from the value set in VBAT_COMP_SETTLING), the comparator's output is latched by the Charger's digital block and used by the FSM.
Note: When the Charger's FSM is in BYPASSED state, this timer is kept to zero and the SW takes over. In this mode, the specific comparator checks the level of Vbat against the Pre-Charge level. Hence, SW can periodically sample the status of this comparator by reading the MAIN_VBAT_COMP_OUT bit-field of CHARGER_STATUS_REG, to determine if Vbat has exceeded the Pre-Charge level or not.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBAT_COMP_SETTLING</name>
	<description>Settling time threshold (in ms) for the Vbat comparator checking Vbat vs the programmed Pre-Charge and Replenish levels. The settings (voltage levels) of the comparator are controlled by the digital block of the Charger and they are driven based on the state of the main FSM (PRE_CHARGE, END_OF_CHARGE).</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_VOLTAGE_PARAM_REG</name>
	<description>Charger voltage settings register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00ca122b</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>V_OVP</name>
	<description>This bit-field determines the VBAT Over-voltage protection limit. This Over-voltage protection level is used by the Charger's analogue circuitry and specifically by a dedicated comparator, the output of which is sampled by the digital block of the Charger. As soon as VBAT is detected to have reached or exceeded this level, the Charger's FSM moves to ERROR state, interrupting charging. If the respective Error IRQ mask bit is set, an Error IRQ pulse will be also generated.
Regarding the actual range of supported values for this bit-field, see the the description of V_CHARGE bit-field of this register.</description>
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_REPLENISH</name>
	<description>This bit-field determines the absolute value (in V) of the Replenish voltage threshold. As soon as charging has been completed and the Charger's FSM has reached the END_OF_CHARGE state, the respective analogue comparator of the Charger compares VBAT with the Replenish level. If VBAT is found to have dropped below this level, charging should start-over again and in that case, the FSM moves again to the PRE_CHARGE state.
Regarding the supported Replenish voltage levels, see the description of V_CHARGE bit-field.</description>
	<bitRange>[17:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_PRECHARGE</name>
	<description>This bit-field determines the voltage level at which the battery is considered as Pre-charged and therefore the Charger's FSM should move to the CC_CHARGE state, entering the Constant Current charging phase.
Regarding the supported Pre-Charge voltage levels, see also the description of V_CHARGE bit-field of this register.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_CHARGE</name>
	<description>This bit-field determines the charge voltage levels supported. The supported levels are determined according to the following encoding:
0   : 2.80 V
1   : 2.85 V
2   : 2.90 V
3   : 2.95 V
4   : 3.00 V
5   : 3.05 V
6   : 3.10 V
