davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>BOD_VBUS</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VBAT</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VSYS</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_V18F</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_V18P</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_V18</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_V14</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_V12</name>
	<description>1: below trigger level (BOD event)
0: above trigger level</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CLK_AMBA_REG</name>
	<description>HCLK, PCLK, divider and clock gates</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000052</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>OQSPI_PULLUP_ENABLE</name>
	<description>Selects pull value when OQSPIF_D* pads are not output.
0: The pads are pull-down
1: The pads are pull-up (to V18F)</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OQSPI_GPIO_MODE</name>
	<description>If this bit is set, the upper 4 pins of the OQSPIF controller can be used as GPIO, P2_07 to P2_04.
In this mode, the OQSPIF controller should be restricted to QUAD mode or less.
Note: the supply remains V18F, so if the supply is off, the pads become floating.</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPIC2_ENABLE</name>
	<description>Clock enable for QSPI RAM controller </description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPIC2_DIV</name>
	<description>Clock divider setting.
0b00: divide by 1
0b01: divide by 2
0b10: divide by 4
0b11: divide by 8</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPIC_ENABLE</name>
	<description>Clock enable for QSPI FLASH2 controller </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPIC_DIV</name>
	<description>Clock divider setting.
0b00: divide by 1
0b01: divide by 2
0b10: divide by 4
0b11: divide by 8</description>
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OQSPIF_ENABLE</name>
	<description>Clock enable for Octal SPI controller </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OQSPIF_DIV</name>
	<description>Clock divider setting.
0b00: divide by 1
0b01: divide by 2
0b10: divide by 4
0b11: divide by 8</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OTP_ENABLE</name>
	<description>Clock enable for OTP controller </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AES_CLK_ENABLE</name>
	<description>Clock enable for AES crypto block </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLOW_PCLK_DIV</name>
	<description>Slow-APB interface clock, derived from DIVN_CLK:
0b000: divide divn_clk by 1
0b001: divide divn_clk by 2
0b010: divide divn_clk by 4
0b011: divide divn_clk by 8
0b1xx: divide divn_clk by 16</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PCLK_DIV</name>
	<description>Fast-APB interface clock, Cascaded with HCLK:
0b00: divide hclk by 1
0b01: divide hclk by 2
0b10: divide hclk by 4
0b11: divide hclk by 8 </description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HCLK_DIV</name>
	<description>AHB interface and microprocessor clock. Source clock divided by:
0b000: divide clk by 1
0b001: divide clk by 2
0b010: divide clk by 4
0b011: divide clk by 8
0b1xx: divide clk by 16</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_CMAC_SWITCH_REG</name>
	<description>Clock switching register for CMAC clock domain</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>CMAC_RUNNING_ON_XTAL</name>
	<description>This bit is 1 when the CMAC_CLK is enabled, and the switch is set in the XTAL32M position.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_RUNNING_ON_DIVN</name>
	<description>This bit is 1 when the CMAC_CLK is enabled, and the switch is set in the DIVN_CLK position.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_CLK_SEL</name>
	<description>Selects the clock source of the CMAC_CLK.
0: DIVN_CLK is selected
1: XTAL32M is selected.
Note: this bitfield can only be set to 1 when the PD_RAD domain is on (RAD_IS_UP), and will be automatically reset to 0 when the PD_RAD power domain turns off.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_CTRL_REG</name>
	<description>Clock control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00002001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RUNNING_AT_PLL</name>
	<description>Indicates that the PLL clock is used as clock, and may not be switched off </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RUNNING_AT_XTAL32M</name>
	<description>Indicates that the XTAL32M clock is used as clock, and may not be switched off </description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RUNNING_AT_RCHS</name>
	<description>Indicates that the RCHS clock is used as clock </description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RUNNING_AT_RCLP</name>
	<description>Indicates that the RCLP_CLK is being used as clock </description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VAD_CLK_SEL</name>
	<description>Selects the clock for the VAD.
0: Select RCLP clock (normalized for ~32 kHz)
1: Select XTAL32K</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USB_CLK_SRC</name>
	<description>Selects the USB source clock
0 : USB PLL 48 MHz clk
1 : DIVN clk, to be used in suspend mode</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LP_CLK_SEL</name>
	<description>Sets the clock source of the LowerPower clock
0x0: RCLP
0x1: RCX
0x2: XTAL32K through the oscillator with an external Crystal.
0x3: XTAL32K through an external square wave generator (set PID of GPIO to FUNC_GPIO)</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS_CLK_SEL</name>
	<description>Selects the clock source.
0x0 : XTAL32M
0x1 : RCHS
0x2 : RCLP
0x3 : The PLL 160 MHz is used
Note: switching to/from PLL may only be done from/to XTAL32M.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RADIO_REG</name>
	<description>Radio PLL control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>RAD_REG_RESET_REQ</name>
	<description>Reset request for registers of the radio PHY.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFCU_ENABLE</name>
	<description>Enable the RF control Unit clock </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC_SYNCH_RESET</name>
	<description>Force synchronous reset to CMAC core and Sleep Timer. Its effective only when both Radio and Timer Power Domains are powered and the clocks are enabled.
CMAC CPU and CMAC registers, including the retained ones, will be reset.
It should be kept in reset for enough time to make sure that it will be captured by CMAC, Low Power and APB clocks.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC_CLK_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RCHS_REG</name>
	<description>Fast RC control register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001804ae</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>RCHS_SPEED</name>
	<description>Selects speed of RCHS output
0b00: 32 MHz, by dividing 96 / 3.
0b01: 96 MHz, by dividing 96 /1.
0b1x: 64 MHz.
Note: switching to/from 64 MHz requires the RCHS to settle, which can be &gt; 100 ms.
Switching 32 to/from 96 MHz does not require settling.</description>
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCHS_INIT_RANGE</name>
	<description>Course frequency adjustment</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCHS_INIT_DEL</name>
	<description>Fine frequency adjustment</description>
	<bitRange>[19:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCHS_INIT_DTCF</name>
	<description>Fine duty-cycle adjustment.
0x0: minimum
0x2: default
0x4: maximum
0x5 until 0x7: oscillator does not work</description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCHS_INIT_DTC</name>
	<description>Course duty-cycle adjustment.
0x0: minimum
0x5: default
0xA: maximum
0xB until 0xF: oscillator does not work</description>
	<bitRange>[8:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCHS_BIAS</name>
	<description>Bias adjustment. Avoid higher bias trim settings (for example, 0xF), the resulting LDO output voltage might be too high. The voltage can be measured with the GP-ADC.</description>
	<bitRange>[4:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCHS_ENABLE</name>
	<description>Enables the HighSpeed RC oscillator.
Setting this bit will always-enable the oscillator, overruling the Hardware control</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RCLP_REG</name>
	<description>32/512 kHz RC oscillator register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>RCLP_LOW_SPEED_FORCE</name>
	<description>Forces RCLP in 32-kHz mode. If this bit is 0 then RCLP frequency is 512 kHz</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCLP_TRIM</name>
	<description>0000 = lowest frequency
0111 = default
1111 = highest frequency </description>
	<bitRange>[4:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCLP_ENABLE</name>
	<description>Enables the 32-kHz RC oscillator.
Do not disable this bit, as deep/extended sleep state is not correctly entered.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RCX_REG</name>
	<description>RCX-oscillator control register</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000afc</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>RCX_BIAS</name>
	<description>LDO bias current.
0x0: minimum
0xF: maximum</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX_C0</name>
	<description>Add unit capacitance to RC-time delay.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX_CADJUST</name>
	<description>Adjust capacitance part of RC-time delay.
0x00: minimum capacitance
0x1F: maximum capacitance</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RCX_ENABLE</name>
	<description>0: Disable the RCX oscillator (watchdog runs at RCLP)
1: Enable the RCX oscillator (watchdog runs at RCX)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_RTCDIV_REG</name>
	<description>Divisor for RTC 100Hz clock</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00051ea8</resetValue>
	<resetMask>0x003fffff</resetMask>
	<fields><field>
	<name>RTC_RESET_REQ</name>
	<description>Reset request for the RTC module</description>
	<bitRange>[21:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_DIV_ENABLE</name>
	<description>Enable for the 100 Hz generation for the RTC block</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_DIV_DENOM</name>
	<description>Selects the denominator for the fractional division:
0b0: 1000
0b1: 1024</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_DIV_INT</name>
	<description>Integer divisor part for RTC 100 Hz generation</description>
	<bitRange>[18:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_DIV_FRAC</name>
	<description>Fractional divisor part for RTC 100 Hz generation.
if RTC_DIV_DENOM=1, &lt;RTC_DIV_FRAC&gt; out of 1024 cycles will divide by &lt;RTC_DIV_INT+1&gt;, the rest is &lt;RTC_DIV_INT&gt;
If RTC_DIV_DENOM=0, &lt;RTC_DIV_FRAC&gt; out of 1000 cycles will divide by &lt;RTC_DIV_INT+1&gt;, the rest is &lt;RTC_DIV_INT&gt;</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_SNC_CTRL_REG</name>
	
