davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
63: 252 ms
64: 268 ms
...
127: 1260 ms</description>
	<bitRange>[28:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_BLANK</name>
	<description>Blanking time for comparator output
0: disabled
1: 4 ms
2: 8 ms
3: 16 ms
4: 32 ms
5: 64 ms</description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_LVL</name>
	<description>Comparator triplevel
0: 30 %
1: 35 %
2: 45 %
3: 60 %</description>
	<bitRange>[18:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPL_SET</name>
	<description>Amplitude Regulator input level setting (peak-peak) in SETTLE phase of startup
0: 300 mV
1: 350 mV
..
7: 900 mV</description>
	<bitRange>[16:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_SET</name>
	<description>Current setting (units of 16 mA) in SETTLE phase of startup
0: OFF
1: 1x
2: 2x
3: 3x
4: 4x
5: 6x
6: 8x
7: 12x
8: 16x
9: 24x
10: 32x
11: 48x
12: 64x
13: 96x
14: 128x
15: 192x</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Capacitance bank seting in SETLLE phase of startup
0x2BF: lowest oscillation frequency (highest load capacitance)
0x0: highest oscillation frequency (lowest load capacitance)
CL = 3.68pF + 10.8fF/LSB</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_START_REG</name>
	<description>Trim values for XTAL32M in START state of startup</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001c312c</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_TIMEOUT</name>
	<description>Timeout
0: disabled
1: 4 ms
2: 8 ms

63: 252 ms
64: 268 ms
...
127: 1260 ms</description>
	<bitRange>[28:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_BLANK</name>
	<description>Blanking time for comparator output
0: disabled
1: 4 ms
2: 8 ms
3: 16 ms
4: 32 ms
5: 64 ms</description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_LVL</name>
	<description>Comparator triplevel
0: 30 %
1: 35 %
2: 45 %
3: 60 %</description>
	<bitRange>[18:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPL_SET</name>
	<description>Amplitude Regulator input level setting (peak-peak) in START phase of startup
0: 300 mV
1: 350 mV
..
7: 900 mV</description>
	<bitRange>[16:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_SET</name>
	<description>Current setting (units of 16 mA) in START phase of startup
0: OFF
1: 1x
2: 2x
3: 3x
4: 4x
5: 6x
6: 8x
7: 12x
8: 16x
9: 24x
10: 32x
11: 48x
12: 64x
13: 96x
14: 128x
15: 192x</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Capacitance bank seting in START phase of startup.
0x2BF: lowest oscillation frequency (highest load capacitance)
0x0: highest oscillation frequency (lowest load capacitance)
When XTAL32M_TRIM_REG.XTAL32M_TRIM is smaller than XTAL32M_START_REG.XTAL32M_TRIM, the value from the XTAL32M_TRIM_REG.XTAL32M_TRIM will be used.
CL = 3.68pF + 10.8fF/LSB.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_STAT0_REG</name>
	<description>XTAL32M status register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00ffc000</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_OVERLOAD</name>
	<description>Indicates xtal is overloaded</description>
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_CMP_LVL_STAT</name>
	<description>Current value for amplitude regulator comparator setting</description>
	<bitRange>[28:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_AMPL_TRIM</name>
	<description>Current value for amplitude trim</description>
	<bitRange>[26:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_TRIM_VAL</name>
	<description>Current value for oscillator trimming</description>
	<bitRange>[23:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_CUR_SET_STAT</name>
	<description>Current value for cur_set</description>
	<bitRange>[13:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_LDO_OK</name>
	<description>Indicates LDO voltage level is ok</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_CMP_OUT</name>
	<description>Amplitude regulator comparator output state</description>
	<bitRange>[8:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_STATE</name>
	<description>State of xtal startup FSM
0x0: IDLE
0x1: WAIT_LDO
0x2: WAIT_BIAS
0x3: XTAL_DRIVE
0x4: START_BLANK
0x5: START
0x6: SETTLE_BLANK
0x7: SETTLE
0x8: RUN
0x9: CAP_TEST_IDLE
0xA: CAP_TEST_MEAS
0xB: CAP_TEST_END</description>
	<bitRange>[6:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_CMP_OUT_HOLD</name>
	<description>Captured state of amplitude regulator comparators at IRQ fire.</description>
	<bitRange>[2:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_READY</name>
	<description>Indicates xtal startup FSM has reached the RUNNIG state and is ready for use (sysclk)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTAL32M_TRIM_REG</name>
	<description>Trim values for XTAL32M in RUNNING state</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00021d2c</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>XTAL32M_BOOST_TRIM</name>
	<description>Boost trimming, set accordingly to shunt capacitance. Sensitivity: 125 fF/LSB
0x0: Boost Disabled
1: 250 fF
2: 375 fF
3: 500 fF;
4: 625 fF;

62: 7.875 pF
63: 8 pF</description>
	<bitRange>[24:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_LVL</name>
	<description>Comparator triplevel
0: 30 %
1: 35 %
2: 45 %
3: 60 %</description>
	<bitRange>[18:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPL_SET</name>
	<description>Amplitude Regulator input level setting (peak-peak) in running phase
0: 300 mV
1: 350 mV
..
7: 900 mV</description>
	<bitRange>[16:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_SET</name>
	<description>Current setting (units of 16 mA) in running phase
0: OFF
1: 1x
2: 2x
3: 3x
4: 4x
5: 6x
6: 8x
7: 12x
8: 16x
9: 24x
10: 32x
11: 48x
12: 64x
13: 96x
14: 128x
15: 192x</description>
	<bitRange>[13:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Capacitance bank seting in running phase, use to trim the xtal32m output frequency
0x2BF: lowest oscillation frequency (highest load capacitance)
0x0: highest oscillation frequency (lowest load capacitance)
CL = 3.68 pF + 10.8 fF/LSB</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCACHE</name>
	<version>1.0</version>
	<description>DCACHE registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30100000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>40</size>
	<usage>registers</usage>
</addressBlock>
	
