davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
Values:
0x0 (BYTES_4K): 4K bytes SDMA Buffer Boundary
0x1 (BYTES_8K): 8K bytes SDMA Buffer Boundary
0x2 (BYTES_16K): 16K bytes SDMA Buffer Boundary
0x3 (BYTES_32K): 32K bytes SDMA Buffer Boundary
0x4 (BYTES_64K): 64K bytes SDMA Buffer Boundary
0x5 (BYTES_128K): 128K bytes SDMA Buffer Boundary
0x6 (BYTES_256K): 256K bytes SDMA Buffer Boundary
0x7 (BYTES_512K): 512K bytes SDMA Buffer Boundary
</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_BLOCK_SIZE</name>
	<description>Transfer Block Size.
These bits specify the block size of data transfers. In case of memory, it is set to 512 bytes. It can be accessed only if no transaction is executing. Read operations during transfers may return
an invalid value, and write operations are ignored.
Following are the values for XFER_BLOCK_SIZE:
- 0x1: 1 byte
- 0x2: 2 bytes
- 0x3: 3 bytes
- ...... 
- 0x1FF: 511 byte
- 0x200: 512 bytes
- ......   
- 0x800: 2048 bytes
Note: This register must be programmed with a non-zero value for data transfer.</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_BOOT_CTRL_R_REG</name>
	<description>This register is used to control the eMMC Boot operation.</description>
	<addressOffset>0x0000052e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>BOOT_TOUT_CNT</name>
	<description>Boot Ack Timeout Counter Value.
This value determines the interval by which boot ack timeout (50 ms) is detected when boot ack is expected during boot operation.
- 0xF : Reserved
- 0xE : TMCLK x 2^27
- ..   - ............
- 0x1 : TMCLK x 2^14
- 0x0 : TMCLK x 2^13</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOT_ACK_ENABLE</name>
	<description>Boot Acknowledge Enable
When this bit set, emmc checks for boot acknowledge start pattern of 0-1-0 during boot operation. This bit is applicable for both mandatory and alternate boot mode.
Values:
0x1 (TRUE): Boot Ack enable
0x0 (FALSE): Boot Ack disable</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VALIDATE_BOOT</name>
	<description>Validate Mandatory Boot Enable bit
This bit is used to validate the MAN_BOOT_EN bit.
Values:
0x1 (TRUE): Validate Mandatory boot enable bit
0x0 (FALSE): Ignore Mandatory boot Enable bit</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>MAN_BOOT_EN</name>
	<description>Mandatory Boot Enable
This bit is used to initiate the mandatory boot operation. The application sets this bit along with VALIDATE_BOOT bit. Writing 0 is ignored. The emmc clears this bit after the boot transfer is completed or terminated.
Values:
0x1 (MAN_BOOT_EN): Mandatory boot enable
0x0 (MAN_BOOT_DIS): Mandatory boot disable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_BUF_DATA_R_REG</name>
	<description>This register is used to access the packet buffer. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BUF_DATA</name>
	<description>Buffer Data.
These bits enable access to the Host Controller packet buffer.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_CAPABILITIES1_R_REG</name>
	<description>This register provides the Host Driver with information specific to the Host Controller implementation. The host controller may implement these values as fixed or loaded from the flash memory during power on initialization. Capabilities register is segregated into two 32-bit registers: CAPABILITIES1_R and CAPABILITIES2_R. The CAPABILITIES1_R register is the lower part of Capabilities register.</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x206e30a0</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SLOT_TYPE_R</name>
	<description>Slot Type
These bits indicate usage of a slot by a specific Host System.
Values:
0x0 (REMOVABLE_SLOT): Removable Card Slot
0x1 (EMBEDDED_SLOT): Embedded Slot for one Device
0x2 (SHARED_SLOT): Shared Bus Slot (SD mode)
0x3 (UHS2_EMBEDDED_SLOT): UHS-II MultipleEmbedded Devices</description>
	<bitRange>[31:30]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ASYNC_INT_SUPPORT</name>
	<description>Asynchronous Interrupt Support (SD Mode only)
Values:
0x0 (FALSE): Asynchronous Interrupt Not Supported
0x1 (TRUE): Asynchronous Interrupt Supported</description>
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_ADDR_64_V3</name>
	<description>64-bit System Address Support for V3
This bit sets the Host controller to support 64-bit System Addressing of V3 mode.
SDMA cannot be used in 64-bit Addressing in Version 3 Mode.
If this bit is set to 1, 64-bit ADMA2 with using 96-bit Descriptor can be enabled by setting Host Version 4 Enable (HOST_VER4_ENABLE = 0) and DMA select (DMA_SEL = 11b).
Values:
0x0 (FALSE): 64-bit System Address for V3 is Not Supported
0x1 (TRUE): 64-bit System Address for V3 is Supported</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_ADDR_64_V4</name>
	<description>64-bit System Address Support for V4
This bit sets the Host Controller to support 64-bit System Addressing of V4 mode. When this bit is set to 1, full or part of 64-bit address must be used to decode the Host Controller Registers so that Host Controller Registers can be placed above system memory area. 64-bit address decode of Host Controller registers is effective regardless of setting to 64-bit Addressing in Host Control 2.
If this bit is set to 1, 64-bit DMA Addressing for version 4 is enabled by setting Host Version 4 Enable
(HOST_VER4_ENABLE = 1) and by setting 64-bit Addressing (ADDRESSING =1) in the Host Control 2 register. SDMA can be used and ADMA2 uses 128-bit Descriptor.
Values:
0x0 (FALSE): 64-bit System Address for V4 is Not Supported
0x1 (TRUE): 64-bit System Address for V4 is Supported</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VOLT_18</name>
	<description>Voltage Support for 1.8 V
Values:
0x0 (FALSE): 1.8 V Not Supported
0x1 (TRUE): 1.8 V Supported</description>
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VOLT_30</name>
	<description>Voltage Support for SD 3.0 V or Embedded 1.2 V
Values:
0x0 (FALSE): SD 3.0 V or Embedded 1.2 V Not Supported
0x1 (TRUE): SD 3.0 V or Embedded Supported</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VOLT_33</name>
	<description>Voltage Support for 3.3 V
Values:
0x0 (FALSE): 3.3 V Not Supported
0x1 (TRUE): 3.3 V Supported</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SUS_RES_SUPPORT</name>
	<description>Suspense/Resume Support
This bit indicates whether the Host Controller supports Suspend/Resume functionality. If this bit is 0, the Host Driver does not issue either Suspend or Resume commands because the Suspend and Resume mechanism is not supported.
Values:
0x0 (FALSE): Not Supported
0x1 (TRUE): Supported</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDMA_SUPPORT</name>
	<description>SDMA Support
This bit indicates whether the Host Controller is capable of using SDMA to transfer data between the system memory and the Host Controller directly.
Values:
0x0 (FALSE): SDMA not Supported
0x1 (TRUE): SDMA Supported</description>
	<bitRange>[22:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HIGH_SPEED_SUPPORT</name>
	<description>High Speed Support
This bit indicates whether the Host Controller and the Host System supports High Speed mode and they can supply the SD Clock frequency from 25 MHz to 50 MHz.
Values:
0x0 (FALSE): High Speed not Supported
0x1 (TRUE): High Speed Supported</description>
	<bitRange>[21:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADMA2_SUPPORT</name>
	<description>ADMA2 Support
This bit indicates whether the Host Controller is capable of using ADMA2.
Values:
0x0 (FALSE): ADMA2 not Supported
0x1 (TRUE): ADMA2 Supported</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EMBEDDED_8_BIT</name>
	<description>8-bit Support for Embedded Device
This bit indicates whether the Host Controller is capable of using an 8-bit bus width mode. This bit is not effective when the Slot Type is set to 10b.
Values:
0x0 (FALSE): 8-bit Bus Width not Supported
0x1 (TRUE): 8-bit Bus Width Supported</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_BLK_LEN</name>
	<description>Maximum Block Length
This bit indicates the maximum block size that the Host driver can read and write to the buffer in the Host Controller. The buffer transfers this block size without wait cycles. The transfer block length is always 512 bytes for the SD Memory irrespective of this bit
Values:
0x0 (ZERO): 512 B
0x1 (ONE): 1024 B
0x2 (TWO): 2048 B
0x3 (THREE): Reserved</description>
	<bitRange>[17:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BASE_CLK_FREQ</name>
	<description>Base Clock Frequency for SD clock
These bits indicate the base (maximum) clock frequency for the SD Clock. The definition of these bits depend on the Host Controller Version.
- 6-Bit Base Clock Frequency: This mode is supported by the Host Controller version 1.00 and 2.00. The upper 2 bits are not effective and are always 0. The unit values are 1 MHz. The supported clock range is 10 MHz to 63 MHz.
-- 0x00 : Get information through another method
-- 0x01 : 1 MHz
-- 0x02 : 2 MHz
-- .............
-- 0x3F : 63 MHz
-- 0x40-0xFF : Not Supported
- 8-Bit Base Clock Frequency: This mode is supported by the Host Controller version 3.00. The unit values are 1 MHz. The supported clock range is 10 MHz to 255 MHz.
-- 0x00 : Get information through another method
-- 0x01 : 1 MHz
-- 0x02 : 2 MHz
-- ............
-- 0xFF : 255 MHz
If the frequency is 16.5 MHz, the larger value is set to 0001001b (17 MHz) because the Host Driver uses this value to calculate the clock divider value and it does not exceed the upper limit of the SD Clock frequency. If these bits are all 0, the Host system has to get information using a different method.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TOUT_CLK_UNIT</name>
	<description>Timeout Clock Unit
This bit shows the unit of base clock frequency used to detect Data TImeout Error.
Values:
0x0 (kHZ): kHz
0x1 (MHZ): MHz</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TOUT_CLK_FREQ</name>
	<description>
Timeout Clock Frequency

This bit shows the base clock frequency used to detect Data Timeout Error. The Timeout Clock unit defines the unit of timeout clock frequency. It can be kHz or MHz.
- 0x00 : Get information through another method
- 0x01 :  1 kHz/1 MHz
- 0x02 :  2 kHz /2 MHz
- 0x03 :  3 kHz/3 MHz
-  ...........
- 0x3F : 63 kHz/63 MHz</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_CAPABILITIES2_R_REG</name>
	<description>This register provides the Host Driver with information specific to the Host Controller implementation. The host controller may implement these values as fixed or as loaded from flash memory during power on initialization. Capabilities register is segregated into two 32-bit registers, namely CAPABILITIES1_R and CAPABILITIES2_R. The CAPABILITIES2_R register is upper part of Capabilities register.</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000077</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>VDD2_18V_SUPPORT</name>
	<description>1.8 V VDD2 Support
This bit indicates support of VDD2 for the Host System.
Values:
0x0 (FALSE): 1.8 V VDD2 is not Supported
0x1 (TRUE): 1.8 V VDD2 is Supported</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADMA3_SUPPORT</name>
	<description>ADMA3 Support
This bit indicates whether the Host Controller is capable of using ADMA3.
Values:
0x0 (FALSE): ADMA3 not Supported
0x1 (TRUE): ADMA3 Supported</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_MUL</name>
	<description>Clock Multiplier
These bits indicate the clock multiplier of the programmable clock generator. Setting these bits to 0 means that the Host Controller does not support a programmable clock generator.
- 0x0: Clock Multiplier is not Supported
- 0x1: Clock Multiplier M = 2
- 0x2: Clock Multiplier M = 3
-   .........
- 0xFF: Clock Multiplier M = 256</description>
	<bitRange>[23:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RE_TUNING_MODES</name>
	<description>Re-Tuning Modes (UHS-I only)
These bits select the re-tuning method and limit the maximum data length.
Values:
0x0 (MODE1): Timer
0x1 (MODE2): Timer and Re-Tuning Request (Not supported)
0x2 (MODE3): Auto Re-Tuning (for transfer)
0x3 (RSVD_MODE): Reserved</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USE_TUNING_SDR50</name>
	<description>Use Tuning for SDR50 (UHS-I only)
</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RETUNE_CNT</name>
	<description>Timer Count for Re-Tuning (UHS-I only)
- 0x0: Re-Tuning Timer disabled
- 0x1: 1 seconds
- 0x2: 2 seconds
- 0x3: 4 seconds
-  ........
- 0xB: 1024 seconds
- 0xC: Reserved
- 0xD: Reserved
- 0xE: Reserved
- 0xF: Get information from other source</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DRV_TYPED</name>
	<description>Driver Type D Support (UHS-I only)
This bit indicates support of Driver Type D for 1.8 Signaling.
Values:
Description
0x0 (FALSE): Driver Type D is not supported
0x1 (TRUE): Driver Type D is supported</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DRV_TYPEC</name>
	<description>Driver Type C Support (UHS-I only)
This bit indicates support of Driver Type C for 1.8 Signaling.
Values:
0x0 (FALSE): Driver Type C is not supported
0x1 (TRUE): Driver Type C is supported</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DRV_TYPEA</name>
	<description>Driver Type A Support (UHS-I only)
This bit indicates support of Driver Type A for 1.8 Signaling.
Values:
0x0 (FALSE): Driver Type A is not supported
0x1 (TRUE): Driver Type A is supported</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>UHS2_SUPPORT</name>
	<description>UHS-II Support (UHS-II only)
This bit indicates whether Host Controller supports UHS-II.
Values:
0x0 (FALSE): UHS-II is not supported
0x1 (TRUE): UHS-II is supported</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DDR50_SUPPORT</name>
	<description>DDR50 Support (UHS-I only)
Values:
0x0 (FALSE): DDR50 is not supported
0x1 (TRUE): DDR50 is supported</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDR104_SUPPORT</name>
	<description>SDR104 Support (UHS-I only)
This bit mentions that SDR104 requires tuning.
Values:
0x0 (FALSE): SDR104 is not supported
0x1 (TRUE): SDR104 is supported</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDR50_SUPPORT</name>
	<description>SDR50 Support (UHS-I only)
Thsi bit indicates that SDR50 is supported. The bit 13 (USE_TUNING_SDR50) indicates whether SDR50 requires tuning or not.
Values:
0x0 (FALSE): SDR50 is not supported
0x1 (TRUE): SDR50 is supported</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_CLK_CTRL_R_REG</name>
	<description>This register controls SDCLK (card clock) in an SD/eMMC mode and RCLK in the UHS-II mode. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FREQ_SEL</name>
	<description>SDCLK/RCLK Frequency Select.
These bits are used to select the frequency of the SDCLK signal. These bits depend on setting of Preset Value Enable in the Host Control 2 register. If Preset Value Enable = 0, these bits are set by the Host Driver. If Preset Value Enable = 1, these bits are automatically set to a value specified in one of the Preset Value register. The value is reflected on the lower 8-bit of the card_clk_freq_sel signal. 
10-bit Divided Clock Mode:
- 0x3FF : 1/2046 Divided clock
- N    : 1/2N Divided Clock
- 0x002  : 1/4 Divided Clock
- 0x001 : 1/2 Divided Clock
- 0x000 : Base clock (10 MHz - 255 MHz)
Programmable Clock Mode : Enables the Host System to select a fine grain SD clock frequency:
- 0x3FF : Base clock  * M /1024
- N-1  : Base clock  * M /N
- 0x002  : Base clock  * M /3
- 0x001 : Base clock  * M /2
- 0x000 : Base clock  * M</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UPPER_FREQ_SEL</name>
	<description>These bits specify the upper 2 bits of 10-bit SDCLK/RCLK Frequency Select control. The value is reflected on the upper 2 bits of the card_clk_freq_sel signal.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_GEN_SELECT</name>
	<description>Clock Generator Select.
This bit is used to select the clock generator mode in SDCLK/RCLK Frequency Select. If Preset Value Enable = 0, this bit is set by the Host Driver. If Preset Value Enable = 1, this bit is automatically set to a value specified in one of the Preset Value registers. The value is reflected on the card_clk_gen_sel signal.

Values:
0x0 (FALSE): Divided Clock Mode
0x1 (TRUE): Programmable Clock Mode</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_ENABLE</name>
	<description>PLL Enable.
This bit is used to activate the PLL (applicable when Host Version 4 Enable = 1). When Host Version 4 Enable = 0, INTERNAL_CLK_EN bit may be used to activate PLL. The value is reflected on the card_clk_en signal.
Note: If this bit is not used to to active the PLL when Host Version 4 Enable = 1, it is recommended to set this bit to 1 .

Values:
0x0 (FALSE): PLL is in low power mode
0x1 (TRUE): PLL is enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SD_CLK_EN</name>
	<description>SD/eMMC Clock Enable.
This bit stops the SDCLK or RCLK when set to 0. The SDCLK/RCLK Frequency Select bit can be changed when this bit is set to 0.
The value is reflected on the clk2card_on pin.

Values:
0x0 (FALSE): Disable providing SDCLK/RCLK
0x1 (TRUE): Enable providing SDCLK/RCLK</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INTERNAL_CLK_STABLE</name>
	<description>Internal Clock Stable
This bit enables the Host Driver to check the clock stability twice after the Internal Clock Enable bit is set and after the PLL Enable bit is set. This bit reflects the synchronized value of the intclk_stable signal after the Internal Clock Enable bit is set to 1 and also reflects the synchronized value of the card_clk_stable signal after the PLL Enable bit is set to 1.

Values:
0x0 (FALSE): Not Ready
0x1 (TRUE): Ready</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INTERNAL_CLK_EN</name>
	<description>Internal Clock Enable.
This bit is set to 0 when the Host Driver is not using the Host Controller or the Host Controller awaits a wake-up interrupt. The Host Controller must stop its internal clock to enter a very low power state. However, registers can still be read and written to. The value is reflected on the intclk_en signal.
Note: If this bit is not used to control the internal clock (base clock and master clock), it is recommended to set this bit to 1.

Values:
0x0 (FALSE): Stop
0x1 (TRUE): Oscillate</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_CMD_R_REG</name>
	<description>This register is used to provide the information related to a command and a response packet. This register is applicable for an SD/eMMC mode.</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CMD_INDEX</name>
	<description>Command Index.
These bits are set to the command number that is specified in bits 45-40 of the Command Format.</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_TYPE</name>
	<description>Command Type.
These bits indicate the command type.
Note: While issuing Abort CMD using CMD12/CMD52 or reset CMD using CMD0/CMD52, CMD_TYPE field shall be set to 0x3.

Values:
0x3 (ABORT_CMD): Abort
0x2 (RESUME_CMD): Resume
0x1 (SUSPEND_CMD): Suspend
0x0 (NORMAL_CMD): Normal
</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_PRESENT_SEL</name>
	<description>Data Present Select.
This bit is set to 1 to indicate that data is present and that the data is transferred using the DAT line.
This bit is set to 0 in the following instances:
- Command using the CMD line
- Command with no data transfer but using busy signal on the DAT[0] line
- Resume Command

Values:
0x0 (NO_DATA): No Data Present
0x1 (DATA): Data Present
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_IDX_CHK_ENABLE</name>
	<description>Command Index Check Enable.
This bit enables the Host Controller to check the index field in the response to verify if it has the same value as the command index. If the value is not the same, it is reported as a Command Index error.
Note:
- Index Check enable must be set to 0 for the command with no response, R2 response, R3 response and R4 response.
- For the tuning command, this bit must always be set to enable the index check.

Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_CRC_CHK_ENABLE</name>
	<description>Command CRC Check Enable.
This bit enables the Host Controller to check the CRC field in the response. If an error is detected, it is reported as a Command CRC error.
Note:
- CRC Check enable must be set to 0 for the command with no response, R3 response, and R4 response.
- For the tuning command, this bit must always be set to 1 to enable the CRC check.

Values:
0x0 (DISABLED): Disable
0x1 (ENABLED): Enable
</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SUB_CMD_FLAG</name>
	<description>Sub Command Flag.
This bit distinguishes between a main command and a sub command.

Values:
0x0 (MAIN): Main Command
0x1 (SUB): Sub Command
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_TYPE_SELECT</name>
	<description>Response Type Select.
This bit indicates the type of response expected from the card.

