davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
Values:
0x0 (FALSE): No error
0x1 (TRUE): Time out</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_FORCE_AUTO_CMD_STAT_R_REG</name>
	<description>The register is not a physically implemented but is an address at which the Auto CMD Error Status register can be written. This register is applicable for an SD/eMMC mode.  1 : Sets each bit of the Auto CMD Error Status register. 0 : No effect.</description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FORCE_CMD_NOT_ISSUED_AUTO_CMD12</name>
	<description>Force Event for Command Not Issued By Auto CMD12 Error
Values:
0x1 (TRUE): Command Not Issued By Auto CMD12 Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_RESP_ERR</name>
	<description>Force Event for Auto CMD Response Error
Values:
0x1 (TRUE): Auto CMD Response Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_IDX_ERR</name>
	<description>Force Event for Auto CMD Index Error
Values:
0x1 (TRUE): Auto CMD Index Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_EBIT_ERR</name>
	<description>Force Event for Auto CMD End Bit Error
Values:
0x1 (TRUE): Auto CMD End Bit Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_CRC_ERR</name>
	<description>Force Event for Auto CMD CRC Error
Values:
0x1 (TRUE): Auto CMD CRC Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_TOUT_ERR</name>
	<description>Force Event for Auto CMD Timeout Error
Values:
0x1 (TRUE): Auto CMD Timeout Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD12_NOT_EXEC</name>
	<description>Force Event for Auto CMD12 Not Executed
Values:
0x1 (TRUE): Auto CMD12 Not Executed Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>EMMC_FORCE_ERROR_INT_STAT_R_REG</name>
	<description>This register is not physically implemented but is an address at which the Error Interrupt Status register can be written. The effect of a write to this address is reflected in the Error Interrupt Status register if the corresponding bit of the Error Interrupt Status Enable register is set. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FORCE_VENDOR_ERR3</name>
	<description>This bit (FORCE_VENDOR_ERR3) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.
</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_VENDOR_ERR2</name>
	<description>This bit (FORCE_VENDOR_ERR2) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.
</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_VENDOR_ERR1</name>
	<description>This bit (FORCE_VENDOR_ERR1) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.
</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_BOOT_ACK_ERR</name>
	<description>Force Event for Boot Ack error
Values:

0x0 (FALSE): Not Affected
0x1 (TRUE): Boot ack Error Status is set</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_RESP_ERR</name>
	<description>Force Event for Response Error (SD Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Response Error Status is set</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_TUNING_ERR</name>
	<description>Force Event for Tuning Error (UHS-I Mode only)
</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_ADMA_ERR</name>
	<description>Force Event for ADMA Error
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): ADMA Error Status is set</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_ERR</name>
	<description>Force Event for Auto CMD Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): ADMA Error Status is set</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CUR_LMT_ERR</name>
	<description>Force Event for Current Limit Error
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Current Limit Error Status is set</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_DATA_END_BIT_ERR</name>
	<description>Force Event for Data End Bit Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Data End Bit Error Status is set</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_DATA_CRC_ERR</name>
	<description>Force Event for Data CRC Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Data CRC Error Status is set</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_DATA_TOUT_ERR</name>
	<description>Force Event for Data Timeout Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Data Timeout Error Status is set</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_IDX_ERR</name>
	<description>Force Event for Command Index Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command Index Error Status is set</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_END_BIT_ERR</name>
	<description>Force Event for Command End Bit Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command End Bit Error Status is set</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_CRC_ERR</name>
	<description>Force Event for Command CRC Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command CRC Error Status is set</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_TOUT_ERR</name>
	<description>Force Event for Command Timeout Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command Timeout Error Status is set</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>EMMC_HOST_CNTRL_VERS_R_REG</name>
	<description>This register is used to indicate the Host Controller Version number.</description>
	<addressOffset>0x000000fe</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000005</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VENDOR_VERSION_NUM</name>
	<description>Vendor Version Number             

This field is reserved for the vendor version number. Host Driver must not use this status.
</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPEC_VERSION_NUM</name>
	<description>Specification Version Number
These bits indicate the Host controller specification version. The upper and lower 4-bits indicate the version. Values 0x06-0xFF are reserved.
Values:
0x0 (VER_1_00): SD Host Controller Specification Version 1.00
0x1 (VER_2_00): SD Host Controller Specification Version 2.00
0x2 (VER_3_00): SD Host Controller Specification Version 3.00
0x3 (VER_4_00): SD Host Controller Specification Version 4.00
0x4 (VER_4_10): SD Host Controller Specification Version 4.10
0x5 (VER_4_20): SD Host Controller Specification Version 4.20</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_HOST_CTRL1_R_REG</name>
	<description>This register is used to control the operation of the Host Controller. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000028</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CARD_DETECT_SIG_SEL</name>
	<description>Card Detect Signal Selection.
This bit selects a source for card detection. When the source for the card detection is switched, the interrupt must be disabled during the switching period.

Values:
0x1 (CARD_DT_TEST_LEVEL): Card Detect Test Level is selected (for test purpose)
0x0 (SDCD_PIN): SDCD# (card_detect_n signal) is selected (for normal use)</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_DETECT_TEST_LVL</name>
	<description>Card Detect Test Level.
This bit is enabled while the Card Detect Signal Selection is set to 1 and it indicates whether a card inserted or not.

Values:
0x1 (CARD_INSERTED): Card Inserted
0x0 (No_CARD): No Card</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EXT_DAT_XFER</name>
	<description>Extended Data Transfer Width.
This bit controls 8-bit bus width mode of embedded device.

Values:
0x1 (EIGHT_BIT): 8-bit Bus Width
0x0 (DEFAULT): Bus Width is selected by the Data Transfer Width</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_SEL</name>
	<description>DMA Select.
This field is used to select the DMA type.
When Host Version 4 Enable is 1 in Host Control 2 register:
- 0x0 : SDMA is selected
- 0x1 : Reserved
- 0x2 : ADMA2 is selected
- 0x3 : ADMA2 or ADMA3 is selected
When Host Version 4 Enable is 0 in Host Control 2 register:
- 0x0 : SDMA is selected
- 0x1 : Reserved
- 0x2 : 32-bit Address ADMA2 is selected
- 0x3 : 64-bit Address ADMA2 is selected

Values:
0x0 (SDMA): SDMA is selected
0x1 (RSVD_BIT): Reserved
0x2 (ADMA2): ADMA2 is selected
0x3 (ADMA2_3): ADMA2 or ADMA3 is selected</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HIGH_SPEED_EN</name>
	<description>High Speed Enable (SD/eMMC Mode only).
In SD/eMMC mode, this bit is used to determine the selection of preset value for High Speed mode.
Before setting this bit, the Host Driver checks the High Speed Support in the Capabilities register.
Note:emmc always outputs the sd_cmd_out and sd_dat_out lines at the rising edge of cclk_tx clock irrespective of this bit.Please refer the section Connecting the Clock IO interface  in the Mobile Storage Host Controller user guide on clocking requirement for an SD/eMMC card.

Values:
0x1 (HIGH_SPEED): High Speed mode
0x0 (NORMAL_SPEED): Normal Speed mode</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DAT_XFER_WIDTH</name>
	<description>Data Transfer Width.
For SD/eMMC mode,this bit selects the data transfer width of the Host Controller. The Host Driver sets it to match the data width of the SD/eMMC card.

Values:
0x1 (FOUR_BIT): 4-bit mode
0x0 (ONE_BIT): 1-bit mode</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED_CTRL</name>
	<description>LED Control.
This bit is used to caution the user not to remove the card while the SD card is being accessed. The value is reflected on the led_control signal.

