davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_C and may set this bit again after all interrupt requests to INT_C pin are cleared to prevent inadvertent interrupts.

Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled
</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_B_STAT_EN</name>
	<description>INT_B (Embedded) Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_B and may set this bit again after all interrupt requests to INT_B pin are cleared to prevent inadvertent interrupts.

Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_A_STAT_EN</name>
	<description>INT_A (Embedded) Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_A and may set this bit again after all interrupt requests to INT_A pin are cleared to prevent inadvertent interrupts.

Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INTERRUPT_STAT_EN</name>
	<description>Card Interrupt Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Card Interrupt detection is stopped when this bit is cleared and restarted when this bit is set to 1. The Host Driver may clear the Card Interrupt Status Enable before servicing the Card Interrupt and may set this bit again after all interrupt requests from the card are cleared to prevent inadvertent interrupts.

By setting this bit to 0, interrupt input must be masked by implementation so that the interrupt input is not affected by external signal in any state (for example, floating).

Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_REMOVAL_STAT_EN</name>
	<description>Card Removal Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERTION_STAT_EN</name>
	<description>Card Insertion Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_RD_READY_STAT_EN</name>
	<description>Buffer Read Ready Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_WR_READY_STAT_EN</name>
	<description>Buffer Write Ready Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_INTERRUPT_STAT_EN</name>
	<description>DMA Interrupt Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGAP_EVENT_STAT_EN</name>
	<description>Block Gap Event Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_COMPLETE_STAT_EN</name>
	<description>Transfer Complete Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_COMPLETE_STAT_EN</name>
	<description>Command Complete Status Enable
Values:
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_NORMAL_INT_STAT_R_REG</name>
	<description>This register reflects the status of the Normal Interrupt. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>ERR_INTERRUPT</name>
	<description>Error Interrupt.
If any of the bits in the Error Interrupt Status register are set, then this bit is set.

Values:
0x0 (FALSE): No Error
0x1 (TRUE): Error</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CQE_EVENT</name>
	<description>Command Queuing Event
This status is set if Command Queuing/Crypto related event has occurred in eMMC/SD mode. Read CQHCI's CQIS/CRNQIS register for more details.

Values:
0x0 (FALSE): No Event
0x1 (TRUE): Command Queuing Event is detected</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FX_EVENT</name>
	<description>FX Event.
This status is set when R[14] of response register is set to 1 and Response Type R1/R5 is set to 0 in Transfer Mode register. This interrupt is used with response check function.

Values:
0x0 (FALSE): No Event
0x1 (TRUE): FX Event is detected</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RE_TUNE_EVENT</name>
	<description>Re-tuning Event.
This bit is set if the Re-Tuning Request changes from 0 to 1. Re-Tuning request is not supported.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INT_C</name>
	<description>INT_C (Embedded).
This bit is set if INT_C is enabled and if INT_C# pin is in low level. The INT_C# pin is not supported.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INT_B</name>
	<description>INT_B (Embedded).
This bit is set if INT_B is enabled and if INT_B# pin is in low level. The INT_B# pin is not supported.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INT_A</name>
	<description>INT_A (Embedded).
This bit is set if INT_A is enabled and if INT_A# pin is in low level. The INT_A# pin is not supported.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_INTERRUPT</name>
	<description>Card Interrupt.
This bit reflects the synchronized value of:
- DAT[1] Interrupt Input for SD Mode
- DAT[2] Interrupt Input for UHS-II Mode

Values:
0x0 (FALSE): No Card Interrupt
0x1 (TRUE): Generate Card Interrupt</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_REMOVAL_STAT_R</name>
	<description>Card Removal.
This bit is set if the Card Inserted in the Present State register changes from 1 to 0.

Values:
0x0 (FALSE): Card state stable or Debouncing
0x1 (TRUE): Card Removed</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERTION</name>
	<description>Card Insertion
This bit is set if the Card Inserted in the Present State register changes from 0 to 1.

Values:
0x0 (FALSE): Card state stable or Debouncing
0x1 (TRUE): Card Inserted</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_RD_READY</name>
	<description>Buffer Read Ready.
This bit is set if the Buffer Read Enable changes from 0 to 1.

Values:
0x0 (FALSE): Not ready to read buffer
0x1 (TRUE): Ready to read buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_WR_READY</name>
	<description>Buffer Write Ready.
This bit is set if the Buffer Write Enable changes from 0 to 1.

Values:
0x0 (FALSE): Not ready to write buffer
0x1 (TRUE): Ready to write buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_INTERRUPT</name>
	<description>DMA Interrupt.
This bit is set if the Host Controller detects the SDMA Buffer Boundary during transfer. In case of ADMA, by setting the Int field in the descriptor table, the Host controller generates this interrupt. This interrupt is not generated after a Transfer Complete.

Values:
0x0 (FALSE): No DMA Interrupt
0x1 (TRUE): DMA Interrupt is generated</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGAP_EVENT</name>
	<description>Block Gap Event.
This bit is set when both read/write transaction is stopped at block gap due to a Stop at Block Gap Request.

Values:
0x0 (FALSE): No Block Gap Event
0x1 (TRUE): Transaction stopped at block gap</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_COMPLETE</name>
	<description>Transfer Complete.
This bit is set when a read/write transfer and a command with status busy is completed.

Values:
0x0 (FALSE): Not complete
0x1 (TRUE): Command execution is completed</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_COMPLETE</name>
	<description>Command Complete.
In an SD/eMMC Mode, this bit is set when the end bit of a response except for Auto CMD12 and Auto CMD23.
This interrupt is not generated when the Response Interrupt Disable in Transfer Mode Register is set to 1.

Values:
0x0 (FALSE): No command complete
0x1 (TRUE): Command Complete</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_DDR50_R_REG</name>
	<description>This register defines the Preset Value for DDR50 and High Speed DDR speed modes in the SD and eMMC modes, respectively.</description>
	<addressOffset>0x0000006e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate Driver strength value supported for DDR50 bus speed mode. These bits are meaningless for 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
These bits specify a 10-bit preset value that must be set in the SDCLK/RCLK Frequency Select field of the Clock Control register, as described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_DS_R_REG</name>
	<description>This register defines Preset Value for Default Speed mode in SD mode.</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported by 1.8 V signaling bus speed modes. This field is meaningless for the Default speed mode as it uses 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_HS_R_REG</name>
	<description>This register defines Preset Value for High Speed mode in SD mode.</description>
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported by 1.8 V signaling bus speed modes. This field is meaningless for High speed mode as it uses 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_INIT_R_REG</name>
	<description>This register defines Preset Value for Initialization in SD/eMMC mode.</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate that the Driver strength is supported by 1.8 V signaling bus speed modes. These bits are meaningless for 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when the Host Controller supports a programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR104_R_REG</name>
	<description>This register defines Preset Value for SDR104 and HS200 speed modes in the SD and eMMC modes, respectively.</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate Driver strength value supported for SDR104 bus speed mode. These bits are meaningless for 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
These bits specify a 10-bit preset value that must be set in the SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR12_R_REG</name>
	<description>This register defines Preset Value for SDR12 and Legacy speed mode in SD and eMMC mode respectively.</description>
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported for the SDR12 bus speed mode. These bits are meaningless for 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR25_R_REG</name>
	<description>This register defines Preset Value for SDR25 and High Speed SDR speed mode in SD and eMMC mode respectively.</description>
	<addressOffset>0x00000068</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported for the SDR25 bus speed mode. These bits are meaningless for 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR50_R_REG</name>
	<description>This register defines Preset Value for SDR50 speed mode in SD mode.</description>
	<addressOffset>0x0000006a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate Driver strength value supported for SDR50 bus speed mode. These bits are meaningless for 3.3 V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_UHS2_R_REG</name>
	<description>This register is used to hold the preset value for UHS-II and HS400 speed modes in the SD and eMMC modes, respectively.</description>
	<addressOffset>0x00000074</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported by 1.8 V signaling bus speed modes in the SD mode. This field is meaningless for UHS-II mode. In eMMC mode, these bits can be used for selecting
the Drive strength value for HS400 mode.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when the Host Controller supports a programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
These bits specify the 10-bit preset value that must be set in the SDCLK/RCLK Frequency Select field of the Clock Control register, as described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PSTATE_REG</name>
	<description>This register indicates the present status of the Host Controller. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x020c0000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>UHS2_IF_DETECT</name>
	<description>UHS-II Interface Detection.
For SD/eMMC mode, this bit always returns 0.

Values:
0x0 (FALSE): UHS-II interface is not detected
0x1 (TRUE): UHS-II interface is detected
</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LANE_SYNC</name>
	<description>Lane Synchronization.
For SD/eMMC mode, this bit always returns 0.

Values:
0x0 (FALSE): UHS-II PHY is not initialized
0x1 (TRUE): UHS-II PHY is initialized
</description>
	<bitRange>[30:30]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IN_DORMANT_ST</name>
	<description>In Dormant Status
For SD/eMMC mode, this bit always returns 0.

