davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<registers>
	<register>
	<name>DEBUG_REG</name>
	<description>Various debug information register.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000101</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ETM_TRACE_MAP_ON_PINS_EN</name>
	<description>1: ETM/TPIU Trace signals mapped on GPIO pins is enabled.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC_CPU_IS_HALTED</name>
	<description>1: SNC CPU is halted.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HALT_SNC_CPU_EN</name>
	<description>1: Enable halting the SNC CPU when the SYS CPU (ARM CM33) or CMAC CPU is halted.
Note 1: This bit is retained.
Note 2: Set this bit to 0 before going into deep sleep to prevent unpredictable halting behavior after waking up.
Note 3: To be able to use this functionality, the SNC CPU debug module (DAP) must be enabled by connecting the debugger tool to it. </description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC_CPU_FREEZE_EN</name>
	<description>1: Enable Freezing on-chip peripherals (see Note 2) by the SNC CPU.
Note 1: This bit is retained.
Note 2: See [RE]SET_FREEZE_REG for the specific on-chip peripherals.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CROSS_CPU_HALT_SENSITIVITY</name>
	<description>Select the cross CPU halt sensitivity.
0: Level triggered,
1: Pulse triggered.
Note: This bit is retained.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS_CPUWAIT_ON_JTAG</name>
	<description>1: Stall the processor core out of reset (only after a wake-up from JTAG). Debugger access continue when the core is stalled. When set to '0' again the core resumes instruction execution.
This feature is independent of the PDC (Power Domain Controller) settings. If this bit is set and there is SW/JTAG activity during deep sleep, the SYS CPU is stalled after the wake-up.
Note: This bit is retained.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS_CPUWAIT</name>
	<description>1: Stall the processor core out of reset (always after a wake-up). Debugger access continue when the core is stalled. When set to 0 again the core resumes instruction execution.
Note: This bit is retained.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC_CPU_IS_HALTED</name>
	<description>1: CMAC CPU is halted.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_CPU_IS_HALTED</name>
	<description>1: SYS CPU (ARM CM33) is halted.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HALT_SYS_CPU_EN</name>
	<description>1: Enable halting the SYS CPU (ARM CM33) when the CMAC CPU or SNC CPU is halted.
Note 1: This bit is retained.
Note 2: Set this bit to 0 before going into deep sleep to prevent unpredictable halting behavior after waking up.
Note 3: To be able to use this functionality, the SYS CPU debug module (DAP) must be enabled by connecting the debugger tool to it. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HALT_CMAC_CPU_EN</name>
	<description>1: Enable halting the CMAC CPU when the SYS CPU (ARM CM33) or SNC CPU is halted.
Note 1: This bit is retained.
Note 2: Set this bit to 0 before going into deep sleep to prevent unpredictable halting behavior after waking up.
Note 3: To be able to use this functionality, the CMAC CPU debug module (DAP) must be enabled by connecting the debugger tool to it. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC_CPU_FREEZE_EN</name>
	<description>1: Enable Freezing on-chip peripherals (see Note 2) by the CMAC CPU.
Note 1: This bit is retained.
Note 2: See [RE]SET_FREEZE_REG for the specific on-chip peripherals.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS_CPU_FREEZE_EN</name>
	<description>1: Enable Freezing on-chip peripherals (see Note 2) by the SYS CPU (ARM CM33).
Default 1, freezing of the on-chip peripherals is enabled when the Cortex-M33 is halted in DEBUG State.
If 0, freezing of the on-chip peripherals is only depending on [RE]SET_FREEZE_REG except the system watchdog timer. The system watchdog timer is always frozen when the Cortex-M33 is halted in DEBUG State.
Note 1: This bit is retained.
Note 2: See [RE]SET_FREEZE_REG for the specific on-chip peripherals.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>GP_STATUS_REG</name>
	<description>General purpose system status register.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>CAL_PHASE</name>
	<description>If 1, it designates that the chip is in Calibration Phase, that is the OTP has been initially programmed but no Calibration has occured. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_FREEZE_REG</name>
	<description>Controls unfreezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>FRZ_SWTIM6</name>
	<description>If 1, the SW Timer6 continues, 0 is discarded. </description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM5</name>
	<description>If 1, the SW Timer5 continues, 0 is discarded. </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SNC_WDOG</name>
	<description>If 1, the SNC SW Watchdog Timer continues, 0 is discarded. </description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_CMAC_WDOG</name>
	<description>If 1, the CMAC SW Watchdog Timer continues, 0 is discarded. </description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM4</name>
	<description>If 1, the SW Timer4 continues, 0 is discarded. </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM3</name>
	<description>If 1, the SW Timer3 continues, 0 is discarded. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_PWMLED</name>
	<description>If 1, the PWM LED continues, 0 is discarded. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM2</name>
	<description>If 1, the SW Timer2 continues, 0 is discarded. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_DMA</name>
	<description>If 1, the DMA continues, 0 is discarded. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_USB</name>
	<description>If 1, the USB continues, 0 is discarded. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SYS_WDOG</name>
	<description>If 1, the SYS SW Watchdog Timer continues, 0 is discarded. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_RESERVED</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM</name>
	<description>If 1, the SW Timer continues, 0 is discarded. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If 1, the Wake Up Timer continues, 0 is discarded. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_FREEZE_REG</name>
	<description>Controls freezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>FRZ_SWTIM6</name>
	<description>If 1, the SW Timer6 is frozen, 0 is discarded. </description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM5</name>
	<description>If 1, the SW Timer5 is frozen, 0 is discarded. </description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SNC_WDOG</name>
	<description>If 1, the SNC SW Watchdog Timer is frozen, 0 is discarded. </description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_CMAC_WDOG</name>
	<description>If 1, the CMAC SW Watchdog Timer is frozen, 0 is discarded. </description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM4</name>
	<description>If 1, the SW Timer4 is frozen, 0 is discarded. </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM3</name>
	<description>If 1, the SW Timer3 is frozen, 0 is discarded. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_PWMLED</name>
	<description>If 1, the PWM LED is frozen, 0 is discarded. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM2</name>
	<description>If 1, the SW Timer2 is frozen, 0 is discarded. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_DMA</name>
	<description>If 1, the DMA is frozen, 0 is discarded. </description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_USB</name>
	<description>If 1, the USB is frozen, 0 is discarded. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SYS_WDOG</name>
	<description>If 1, the SYS SW Watchdog Timer is frozen, 0 is discarded. WATCHDOG_CTRL_REG[NMI_RST] must be 0 to allow the freeze function. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_RESERVED</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_SWTIM</name>
	<description>If 1, the SW Timer is frozen, 0 is discarded. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If 1, the Wake Up Timer is frozen, 0 is discarded. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>USBPAD_REG</name>
	<description>USB pads control register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>USBPHY_FORCE_SW2_ON</name>
	<description>0: Pull-up resistor SW2 is controlled by the USB controller. It is off when the USB is not enabled.
1: Force the pull-up resistor on USBP to be 2.3 kW</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USBPHY_FORCE_SW1_OFF</name>
	<description>0: Pull-up resistor SW1 is controlled by the USB controller. It is off when the USB is not enabled.
1: Force the pull-up resistor on USBP to be switched off.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USBPAD_EN</name>
	<description>0: The power for the USB PHY and USB pads is switched on when the USB is enabled.
1: The power for the USB PHY and USB pads is forced on.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPU_CORE</name>
	<version>1.0</version>
	<description>GPU_CORE registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x51001200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>248</size>
	<usage>registers</usage>
</addressBlock>
	
