davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<registers>
	<register>
	<name>D2_CACHECTL</name>
	<description>#49: Cache control register. Internal caches can be enabled/disabled and flushed using this register. Note that caches will be disabled if a value without its enable bits set is written to D2_CACHECTL.</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>D2C_CACHECTL_FLUSH_TX</name>
	<description>Flush texture cache</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CACHECTL_ENABLE_TX</name>
	<description>Texture cache enable</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CACHECTL_FLUSH_FB</name>
	<description>Flush framebuffer cache</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CACHECTL_ENABLE_FB</name>
	<description>Framebuffer cache enable</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_COLKEY</name>
	<description>#58: Color key value. The R, G, and B components of the internal color representation of a texel is compared with the color key. If the values are equal then A, R, G, and B are set to 0 (transparent), else A is set to 1. Color keying can be enabled by setting bit D2C_COLKEY_ENABLE in D2_CONTROL2</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>COLKEY_RGB</name>
	<description>Color Key Value RGB888</description>
	<bitRange>[23:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_COLOR1</name>
	<description>#25: Base color register. All color registers are *write only*, reading will return undefined results.   When using textures the two color registers (D2_COLOR1 and D2_COLOR2) are still used to modify the color value read from texture memory. The equation applied to each of the four color channels (when texture mapping) is: (c2-c1)*tex+c1. To keep the unmodified texture data c1 has to be 0 and c2 has to be 1, meaning 0x00000000 and 0xffffffff for D2_COLOR1 and D2_COLOR2 respectively. Color is always stored as 32-bit ARGB value. With 0xff000000 being opaque black.</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>COLOR1</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_COLOR2</name>
	<description>#26: Secondary color register. Secondary color is relevant only when rendering patterns, textures or using a D2C_BC2 blendmode (see D2_CONTROL2).</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>COLOR2</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL</name>
	<description>#0: Geometry control register. This register controls the pixel enumeration and selection units, deciding which pixels are part of the geometry. Each geometry limiter can be enabled (default is disabled) by setting one of the enable bits. Note that disabled limiters are always read as 1.0. Limiters are grouped into three pairs of quadratic limiters, each of which can be coupled to track a quadractic instead of a linear equation. Note that in case of a coupled limiter only the first should have its enable Bit set. First two limiter outputs can be routed through an additional unit before clamping to mirror their gradient and form a &quot;band&quot; instead of the usual &quot;halfplane&quot;. By default, each limiter output is clamped to fit into a range of [0..1] but by setting a limiter into threshold mode you can force its output to become binary (exactly 1.0 or exactly 0.0 at all times). All limiter outputs are combined into a single value by an array of combiner units. Each unit does a logical AND (intersection) by default, but can be switched into union mode to perform a logical OR instead. To improve enumeration efficiency on convex shapes, specify the hints for span store and span delay (see also D2_PITCH). To increase the precision of all limiters, the limiter-precision bit can be set (see also feature bits of D2_HWREVISION). Some bits are reserved</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RESERVED</name>
	<description>Reserved for GPU internal use</description>
	<bitRange>[31:27]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIMITERPRECISION</name>
	<description>Increase precision of limiters from 16.16 to 10.22</description>
	<bitRange>[24:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_SPANSTORE</name>
	<description>Nextline span start is always equal or left to current-line span start</description>
	<bitRange>[23:23]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_SPANABORT</name>
	<description>Shape is horizontally convex. only a single span per scanline</description>
	<bitRange>[22:22]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNIONCD</name>
	<description>Combine outputs C and D as union (output is final)</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNIONAB</name>
	<description>Combine outputs A and B as union (output is called C)</description>
	<bitRange>[20:20]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNION56</name>
	<description>Combine limiter 5 and 6 as union (output is called D)</description>
	<bitRange>[19:19]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNION34</name>
	<description>Combine limiter 3 and 4 as union (output is called B)</description>
	<bitRange>[18:18]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNION12</name>
	<description>Combine limiter 1 and 2 as union (output is called A)</description>
	<bitRange>[17:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BAND2ENABLE</name>
	<description>Enable band postprocess for limiter 2 (see &lt;D2_L2BAND&gt;)</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BAND1ENABLE</name>
	<description>Enable band postprocess for limiter 1 (see &lt;D2_L1BAND&gt;)</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM6THRESHOLD</name>
	<description>Enable limiter 6 threshold mode</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM5THRESHOLD</name>
	<description>Enable limiter 5 threshold mode</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM4THRESHOLD</name>
	<description>Enable limiter 4 threshold mode</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM3THRESHOLD</name>
	<description>Enable limiter 3 threshold mode</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM2THRESHOLD</name>
	<description>Enable limiter 2 threshold mode</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM1THRESHOLD</name>
	<description>Enable limiter 1 threshold mode</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_QUAD3ENABLE</name>
	<description>Enable quadratic coupling of limiters 5 and 6</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_QUAD2ENABLE</name>
	<description>Enable quadratic coupling of limiters 3 and 4</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_QUAD1ENABLE</name>
	<description>Enable quadratic coupling of limiters 1 and 2</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM6ENABLE</name>
	<description>Enable limiter 6</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM5ENABLE</name>
	<description>Enable limiter 5</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM4ENABLE</name>
	<description>Enable limiter 4</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM3ENABLE</name>
	<description>Enable limiter 3</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM2ENABLE</name>
	<description>Enable limiter 2</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM1ENABLE</name>
	<description>Enable limiter 1</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL2</name>
	<description>#1: Surface control register. This register controls the colorization, texturing and blending units, deciding what color a pixel should have. By default, the pixel color source is D2_COLOR1 but setting pattern or texture enable changes this. When using texturemapping filtering and clamping, control bits are used to specify details for the fetching of texels. Texture formats are defined by the read format. Writeback frame buffer formats are defined by the write format. The standard GPU uses as framebuffer formats. After a pixelcolor has been constructed the new pixel (src) is blended with the current framebuffer content (dst) as defined by the color channel blend flags. There are two modes for alpha channel blending: If USE_ACB = 0 then the former write-alpha mode is used (see also feature bits of D2_HWREVISION): An &quot;alpha source&quot; is relevant only if the framebuffer format includes an alpha channel. If USE_ACB = 1, then the full alpha channel blending is used as defined by the alpha channel blend flags. bit[xx] D2C_BC2A - blending for alpha channel is done with the alpha channel of D2_COLOR2 instead of the real dst value. This is an internal bit that is set if &quot;alpha source&quot; is set to 00. The entries of the CLUT are 32 bit words (see D2_TEXCLUT_DATA). The RLE format bits define the RLE format.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>D2C_RLEFORMAT2</name>
	<description>Bit1 of RLE texel format</description>
	<bitRange>[31:31]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_RLEFORMAT1</name>
	<description>Bit0 of RLE texel format

