davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
00 - 1 byte per pixel
01 - 2 byte per pixel
10 - 3 byte per pixel
11 - 4 byte per pixel</description>
	<bitRange>[30:30]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDIA</name>
	<description>Dst factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on BDFA)</description>
	<bitRange>[29:29]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSIA</name>
	<description>Src factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on BSFA)</description>
	<bitRange>[28:28]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CLUTFORMAT1</name>
	<description>Bit0 of the CLUT entry format

0 - argb8888 (4 bpp)
1 - rgb565 (2 bpp x 2) two entries per 32 bit word</description>
	<bitRange>[27:27]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_COLKEY_ENABLE</name>
	<description>Enable color keying (see also &lt;D2_COLKEY&gt; and feature bits of &lt;D2_HWREVISION&gt;)</description>
	<bitRange>[26:26]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CLUT_ENABLE</name>
	<description>Enable the use of the CLUT (see also feature bits of &lt;D2_HWREVISION&gt;); if disabled the texture indices are written to FB</description>
	<bitRange>[25:25]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_RLE_ENABLE</name>
	<description>Enable RLE decoder (see also feature bits of &lt;D2_HWREVISION&gt;)</description>
	<bitRange>[24:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEALPHA2</name>
	<description>Bit1 of the &quot;alpha source&quot; (depends on USE_ACB)</description>
	<bitRange>[23:23]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEALPHA1</name>
	<description>Bit0 of the &quot;alpha source&quot; (depends on USE_ACB)

00 - alpha from D2_COLOR2
01 - src alpha (pixel coverage)
10 - reserved (alpha is set to zero)
11 - existing framebuffer alpha (alpha channel is kept unchanged)</description>
	<bitRange>[22:22]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT2</name>
	<description>Bit1 of the framebuffer format descriptor</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT1</name>
	<description>Bit0 of the framebuffer format descriptor

000 - alpha8 (1 bpp)
001 - rgb565 (2 bpp)
010 - argb8888 (4 bpp)
011 - argb4444 (2 bpp)
110 - rgba8888 (4 bpp)
111 - rgba4444 (2 bpp)</description>
	<bitRange>[20:20]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT2</name>
	<description>Bit1 of the texture format descriptor</description>
	<bitRange>[19:19]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT1</name>
	<description>Bit0 of the texture format descriptor

0000 - alpha8 (1 bpp)
0001 - rgb565 (2 bpp)
0010 - argb8888 (4 bpp)
0011 - argb4444 (2 bpp)
0100 - argb1555 (2 bpp)
0101 - ai44 (1 bpp)
0110 - rgba8888 (4 bpp)
0111 - rgba4444 (2 bpp)
1000 - rgba5551 (2 bpp)
1001 - i8 (1 bpp, 1pbb)
1010 - i4 (2 ppb)
1011 - i2 (4 ppb)
1100 - i1 (8 ppb)
1101 - alpha4 (2 ppb)
1110 - alpha2 (4 ppb)
1111 - alpha1 (8 ppb)</description>
	<bitRange>[18:18]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREFILTERY</name>
	<description>Linear filtering on texture v axis</description>
	<bitRange>[17:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREFILTERX</name>
	<description>Linear filtering on texture u axis</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTURECLAMPY</name>
	<description>Clamp instead of mask v coordinate</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTURECLAMPX</name>
	<description>Clamp instead of mask u coordinate</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BC2</name>
	<description>Blending for color channels is done with &lt;D2_COLOR2&gt; instead of the real dst value</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDI</name>
	<description>Dst factor for color channels will be inverted (meaning 1-a or 1-1 depending on BDF)</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSI</name>
	<description>Src factor for color channels will be inverted (meaning 1-a or 1-1 depending on BSF)</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDF</name>
	<description>Dst factor for color channels is alpha (factor is 1 per default)</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSF</name>
	<description>Src factor for color channels is alpha (factor is 1 per default)</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT3</name>
	<description>Bit2 of the framebuffer format descriptor</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDFA</name>
	<description>Dst factor for alpha channel is alpha (factor is 1 per default)</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSFA</name>
	<description>Src factor for alpha channel is alpha (factor is 1 per default)</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT4</name>
	<description>Bit3 of the texture format descriptor</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT3</name>
	<description>Bit2 of the texture format descriptor</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>USE_ACB</name>
	<description>Use full alpha channel blending, else use write-alpha mode</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_PATTERNSOURCEL5</name>
	<description>Limiter 5 is used as pattern index instead of the default U-Limiter</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREENABLE</name>
	<description>Pixel source is read from texture and used as an alpha to blend between &lt;D2_COLOR1&gt; and &lt;D2_COLOR2&gt;</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_PATTERNENABLE</name>
	<description>Pixel source is a pattern color (blend of &lt;D2_COLOR1&gt; and &lt;D2_COLOR2&gt; depending on &lt;D2_PATTERN&gt; and pattern index)</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL3</name>
	<description>#2: Burst length limit control register. This register controls the burst length limit for the master bus interfaces. Log2 of the burst length limit: 0 - 2^0 = single transfer; 2 - 2^2 = max burst length 4; 3 - 2^3 = max burst length 8; 4 - 2^4 = max burst length 16. Valid values depend on the protocol of the used bus interface. </description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x04040404</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>BURSTLENGTH_MDL</name>
	<description>Burst length limit for MDL read (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[26:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>BURSTLENGTH_MTX</name>
	<description>Burst length limit for MTX read (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[18:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>BURSTLENGTH_MFBW</name>
	<description>Burst length limit for MFB write (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[10:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>BURSTLENGTH_MFBR</name>
	<description>Burst length limit for MFB read (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[2:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_DLISTSTART</name>
	<description>#50: Displaylist start address. Setting a new displaylist base address (writing to D2_DLISTSTART) *triggers* execution of the new dlist. Execution will stop only when a new list is set or the list terminates. Note that once the display list is started, the display list reader is the master for all register writes to the core: No register write must be done  via the slave bus as long as the display list execution is ongoing. Otherwise, commands from the display list may be lost and rendering artifacts as well as core hangups can occur.</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DLISTSTART</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_HWREVISION</name>
	<description>#1: Hardware version and feature set ID. Read this (constant) register to identify the present hardware revision and feature set. HW Revision ID structure: Bits[28..16] HWFEATURES - Features. D/AVE Type: 0 - D/AVE2DT-S, 1 - D/AVE2DT-L. Feature Bits: the feature set is defined by the feature bits. The reset value depends on the hardware configuration.</description>
	<addressOffset>0x000000f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1fbe000d</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>FB_BURSTSPLITTING</name>
	<description>Bursts can be split with respect to burst length limit</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_ALPHACHANNELBLENDING</name>
	<description>Full alpha channel blending available</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_HILIMITERPRECISION</name>
	<description>Increasable precision of limiters available</description>
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_COLORKEY</name>
	<description>Color keying available</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_TEXCLUT256</name>
	<description>Extend CLUT to 256x32bit ARGB8888</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_RLEUNIT</name>
	<description>RLE texture decoder available</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_FBPREFETCH</name>
	<description>Framebuffer prefetch available</description>
	<bitRange>[22:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_TEXCLUT</name>
	<description>Color Lookup Table 16x24bit for indexed textureformat available</description>
	<bitRange>[21:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_PERFCOUNT</name>
	<description>Two performance counters available</description>
	<bitRange>[20:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_TXCACHE</name>
	<description>Texture Cache available</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_FBCACHE</name>
	<description>Framebuffer Cache available</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_DLR</name>
	<description>DisplayListReader available</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_SWGPU</name>
	<description>Software GPU</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HWTYPE</name>
	<description>GPU Type</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HWBRANCH</name>
	<description>Branch number</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HWREVISION</name>
	<description>Revision number</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>D2_IRQCTL</name>
	<description>#48: Interrupt control register. The GPU features three sources for interrupts. They can be enabled and cleared individually. Enumeration finished - this interrupt is issued after every enumeration has finished. An enumeration is triggered by writing to D2_ORIGIN. This interrupt can be used if the CPU sets up all registers and waits for the enumeration to finish. It should not be used if the display list reader is active. Dlist finished  - this interrupt is issued if the display list reader is used and it reads a display list end command (see special cases of Display list format). The display list reader starts to execute a display list if the start address of the display list is written to D2_DLISTSTART. Bus error - this interrupt is issued if any of the three bus adapters signals an error (see D2_STATUS). Read D2_STATUS to determine the current IRQ state (inside the IRQ handler, for example).</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>D2IRQCTL_CLR_BUS_ERROR</name>
	<description>Clear Interrupt &quot;Bus error&quot;</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_ENABLE_BUS_ERROR</name>
	<description>Interruptmask enable &quot;Bus error&quot;</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_CLR_FINISH_DLIST</name>
	<description>Clear Interrupt &quot;Displaylist is finished&quot;. Make sure to clear the IRQ before starting the DLR again. No register writes must be done by the CPU while the DLR is active.</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_CLR_FINISH_ENUM</name>
	<description>Clear Interrupt &quot;Enumeration is finished&quot;</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_ENABLE_FINISH_DLIST</name>
	<description>Interruptmask enable &quot;Displaylist is finished&quot;</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_ENABLE_FINISH_ENUM</name>
	<description>Interruptmask enable &quot;Enumeration is finished&quot;</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1BAND</name>
	<description>#22: Limiter1 band width parameter. Postfilter - first two limiter outputs can be routed through an additional unit before clamping to mirror their gradient and form a &quot;band&quot; instead of  the usual &quot;halfplane&quot;. When band output filtering is enabled for limiter1 (D2C_BAND1ENABLE see D2_CONTROL), this register stores the 16:16 fixedpoint inner width of band region.</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1BAND</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1START</name>
	<description>#4: Limiter1 start value. All limiter registers are *write only*, reading will return undefined results. Limiters must be enabled (see D2_CONTROL) to produce an output value. In addition to the 6 geometry limiters there are two special UV-Limiters (see Texture registers). The start value is a 16:16 fixedpoint number valid at the first pixel of the bounding box.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1XADD</name>
	<description>#10: Limiter1 X-Axis increment. The xadd value is the 16:16 fixedpoint difference between two samples with a distance of 1 pix along the x axis.</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1XADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1YADD</name>
	<description>#16: Limiter1 Y-Axis increment. The yadd value is the 16:16 fixedpoint difference between two samples with a distance of 1 pixel along the y axis.</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1YADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L2BAND</name>
	<description>#23: Limiter2 band width parameter. See D2_L1BAND</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L2BAND</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L2START</name>
	<description>#5: Limiter2 start value. See D2_L1START</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L2START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L2XADD</name>
	<description>#11: Limiter2 X-Axis increment. See D2_L1XADD</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L2XADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L2YADD</name>
	<description>#17: Limiter2 Y-Axis increment. See D2_L1YADD</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L2YADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L3START</name>
	<description>#6: Limiter3 start value. See D2_L1START</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L3START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L3XADD</name>
	<description>#12: Limiter3 X-Axis increment</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L3XADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L3YADD</name>
	<description>#18: Limiter3 Y-Axis increment. See D2_L1YADD</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L3YADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L4START</name>
	<description>#7: Limiter4 start value. See D2_L1START</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L4START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L4XADD</name>
	<description>#13: Limiter4 X-Axis increment. See D2_L1XADD</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L4XADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L4YADD</name>
	<description>#19: Limiter4 Y-Axis increment. See D2_L1YADD</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L4YADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L5START</name>
	<description>#8: Limiter5 start value. See D2_L1START</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L5START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L5XADD</name>
	<description>#14: Limiter5 X-Axis increment. See D2_L1XADD</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L5XADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L5YADD</name>
	<description>#20: Limiter5 Y-Axis increment. See D2_L1YADD</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L5YADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L6START</name>
	<description>#9: Limiter6 start value. See D2_L1START</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L6START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L6XADD</name>
	<description>#15: Limiter6 X-Axis increment. See D2_L1XADD</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L6XADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L6YADD</name>
	<description>#21: Limiter6 Y-Axis increment. See D2_L1YADD</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L6YADD</name>
	
