davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LUSTART</name>
	<description>#36: U Limiter start value. The start value is a 16:16 fixedpoint number valid at the first pixel of the bounding box.</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LUSTART</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LUXADD</name>
	<description>#37: U Limiter X-Axis increment. The add value for U is the 16:16 fixedpoint difference between two samples with   a distance of 1 pixel along the x axis.</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LUXADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LUYADD</name>
	<description>#38: U Limiter Y-Axis increment. The add value for U is the 16:16 fixedpoint difference between two samples with a distance of 1 pixel along the y axis.</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LUYADD</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVSTARTF</name>
	<description>#40: V Limiter start value fractional part. The start value is a 32:16 fixedpoint number valid at the first pixel of the bounding box.</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LVSTARTF</name>
	<description>Fractional part.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVSTARTI</name>
	<description>#39: V Limiter start value integer part</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LVSTARTI</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVXADDI</name>
	<description>#41: V Limiter X-Axis increment integer part. The add value for V is the 32:16 fixedpoint difference between two samples with  a distance of 1 pixel along the x axis.</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LVXADDI</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVYADDI</name>
	<description>#42: V Limiter Y-Axis increment integer part. The add value for V is the 32:16 fixedpoint difference between two samples with  a distance of 1 pixel along the y axis.</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LVYADDI</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_LVYXADDF</name>
	<description>#43: V Limiter X and Y increment fractional parts</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>D2_LVYADDI_FRAC</name>
	<description>Y increment fractional part for &lt;D2_LVYADDI&gt;.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2_LVXADDI_FRAC</name>
	<description>X increment fractional part for &lt;D2_LVXADDI&gt;.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_ORIGIN</name>
	<description>#32: Address of the first pixel in framebuffer. Writing to D2_ORIGIN will trigger GPU to start rendering.</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ORIGIN</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_PATTERN</name>
	<description>#29: Pattern register. Each bit in the pattern register is interpreted as a reference to one of two color registers (0bit = D2_COLOR1, 1bit = D2_COLOR2 ).</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PATTERN</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_PERFCOUNT1</name>
	<description>#51: Performance counter. Writing to the D2_PERFCOUNT1 register resets the first internal performance counter to the specified value. Reading returns the actual performance count. GPU will increment the count every time the event selected by D2_PERFTRIGGER lower 16 bits triggers.</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PERFCOUNT1</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>D2_PERFCOUNT2</name>
	<description>#52: Performance counter. Writing to the D2_PERFCOUNT2 register resets the second internal performance counter to the specified value. GPU will increment the count every time the event selected by D2_PERFTRIGGER upper 16 bits triggers.</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PERFCOUNT2</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>D2_PERFTRIGGER</name>
	<description>#53: Performance counters control register. Select the internal event that will increment D2_PERFCOUNT1 respectively D2_PERFCOUNT2 register. Possible event values: D2PC_NONE - disable performance counter (0), D2PC_GPUCYCLES - GPU active cycles (1), D2PC_FBREADS - framebuffer read access (2), D2PC_FBWRITES - framebuffer write access (3), D2PC_TXREADS - texture read access (4), D2PC_INVPIXELS - invisible pixels (enumerated but selected with alpha 0%) (5), D2PC_INVPIXELS_MISS - invisible pixels while internal fifo is empty (lost cycles) (6), D2PC_DLRCYCLES - displaylist reader active cycles (7), D2PC_FBREADHITS - framebuffer read hits (8), D2PC_FBREADMISSES - framebuffer read misses (9), D2PC_FBWRITEHITS - framebuffer write hits (10), D2PC_FBWRITEMISSES - framebuffer write misses (11), D2PC_TEXREADHITS - texture read hits (12), D2PC_TEXREADMISSES - texture read misses (13), D2_PC_DLRBURSTREADS - display list reader burst reads (17), D2_PC_DLRWORDSREAD - display list reader words read (18), D2PC_RLEREWINDS - RLE unit rewinds (20), D2_PC_TEXBURSTREADS - texture cache burst reads (21), D2_PC_TEXWORDSREAD - texture cache words read (22), D2_PC_FBBURSTREADS - framebuffer cache burst reads (23), D2_PC_FBWORDSREAD - framebuffer cache words read (24), D2_PC_FBBURSTWRITES - framebuffer cache burst writes (25), D2_PC_FBWORDSWRITTEN - framebuffer cache words written (26), D2PC_CLKCYCLES - every clock cycle (for use as timer) (31)</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PERFTRIGGER2</name>
	<description>Select the internal event that will increment D2_PERFCOUNT2 register.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PERFTRIGGER1</name>
	<description>Select the internal event that will increment D2_PERFCOUNT1 register.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_PITCH</name>
	<description>#31: Framebuffer pitch and spanstore delay</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SSD</name>
	<description>Spanstore delay, the number of scanlines to delay spanstore operations.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PITCH</name>
	<description>The width (in pixels) of one framebuffer scanline. A negative width can be used to render bottom-up instead of top-down.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_SIZE</name>
	<description>#30: Bounding box dimension</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SIZEY</name>
	<description>The height (in pixels) of the primitives bounding box.</description>
	<bitRange>[31:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SIZEX</name>
	<description>The width (in pixels) of the primitives bounding box.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_STATUS</name>
	<description>#0: Status control register. The current GPU status can be polled by reading this register. It contains a combination of the following bits. Source interface bus error: 001 - MFB interface, 010 - MTX interface, 100 - MDL interface. Depending on the hardware featureset (see D2_HWREVISION) some bits might be irrelevant on a specific HW platform.</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>D2C_IRQ_BUS_ERROR_SRC</name>
	<description>Source interface of bus error</description>
	<bitRange>[10:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_IRQ_BUS_ERROR</name>
	<description>IRQ on bus error</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_IRQ_DLIST</name>
	<description>IRQ on display list finish</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_IRQ_ENUM</name>
	<description>IRQ on enumeration finish</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_DLISTACTIVE</name>
	<description>Display list active, cant direct access hwregs</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_CACHE_DIRTY</name>
	<description>Framebuffer cache dirty, cant flip frame</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_BUSY_WRITE</name>
	<description>Framebuffer writeback busy, cant change framebuffer type</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>D2C_BUSY_ENUM</name>
	<description>Enumeration unit busy, cant start new primitive</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXCLUT</name>
	<description>#54: Color Lookup Table for the indexed texture format 16x24bit&#13;

Triggers a write into the CLUT if CLUT size is 16 x 24bit.</description>
	<addressOffset>0x000000d8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TEXCLUT_INDEX</name>
	<description>Index of the CLUT entry, that shall be written</description>
	<bitRange>[31:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TEXCLUT_RGB</name>
	<description>Color Value RGB888</description>
	<bitRange>[23:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXCLUT_ADDR</name>
	<description>#55: Color Lookup Table write address for the indexed texture format 256x32 bit. Start address for consecutive writes to D2_TEXCLUT_DATA if CLUT size is 256x32 bit.</description>
	<addressOffset>0x000000dc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>TEXCLUT_ADDR</name>
	<description>Write address</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXCLUT_DATA</name>
	<description>#56: Color Lookup Table write data for the indexed texture format 256x32 bit. Writes one 32 bit color value into the CLUT if CLUT size is 256x32 bit. The write address is given by D2_TEXCLUT_ADDR and increments by 1 after each data write. bits[15..0] - first color value RGB565 if CLUTFORMAT = rgb565 for index*2. bits[31..16] - second color value RGB565 if CLUTFORMAT = rgb565 for index*2+1. See also D2_CONTROL2</description>
	<addressOffset>0x000000e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TEXCLUT_ARGB</name>
	<description>Color value ARGB8888 if CLUTFORMAT = argb8888</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXCLUT_OFFSET</name>
	<description>#57: Offset to the texture index for the indexed texture formats i8, i4, i2 and i1. The index offset is combined with the texture index by a bitwise OR operation. For subbyte texture formats the CLUT can be divided into parts with different color sets.</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>TEXCLUT_OFFSET</name>
	<description>Index offset</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXMASK</name>
	<description>#46: Texture size or texture address mask. Depending on the clamping mode this register encodes the clamp limit or wrap  mask.</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TEXVMASK</name>
	<description>V mask.</description>
	<bitRange>[31:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TEXUMASK</name>
	<description>U mask.</description>
	<bitRange>[10:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXORIGIN</name>
	<description>#47: Texture base address. All texture registers are *write only*, reading will return undefined results.   Patterns and textures require a 1D or 2D index (UV Coordinate) at every pixel. Specialized UV-Limiters are available to generate these. Address of the upper left corner texel. Addresses inside the framebuffer can be used as valid texture origin as well.</description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TEXORIGIN</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_TEXPITCH</name>
	<description>#45: Texels per texture line&#13;

Pitch is equal or bigger than texture width.</description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TEXPITCH</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPU_REG</name>
	<version>1.0</version>
	<description>GPU_REG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x51001100</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>4</size>
	<usage>registers</usage>
</addressBlock>
	
