davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
The valid range is 0 to 3. The software shall program only valid values. A value of 0 sets the threshold for 1 entry, and a value of N sets the threshold for N+1 entries.
</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_EMPTY_BUF_THLD</name>
	<description>Command Buffer Empty Threshold Value. Controls the number of empty locations (or greater) in the Command Queue that trigger CMD_QUEUE_READY_STAT interrupt.

The valid range is 0 to 7. The software shall program only valid values. Value of N ranging from 1 to 7 sets the threshold to N empty locations and a value of 0 sets the threshold to indicate that the queue is completely empty.
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_RESET_CTRL_REG</name>
	<description>Reset Control Register </description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>IBI_QUEUE_RST</name>
	<description>IBI Queue Software Reset.

This bit is only used in master mode of operation.

Write 1'b1 to this bit to exercise IBI Queue reset This bit will be cleared automatically once the IBI Queue reset is completed.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_FIFO_RST</name>
	<description>Receive Buffer Software Reset.

Write 1'b1 to this bit to exercise Receive Buffer reset. This bit will be cleared automatically once the Receive buffer reset is completed.
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_FIFO_RST</name>
	<description>Transmit Buffer Software Reset.

Write 1'b1 to this bit to exercise Transmit Buffer reset. This bit will be cleared automatically once the Transmit Buffer reset is completed.
</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_QUEUE_RST</name>
	<description>Response Queue Software Reset.

Write 1'b1 to this bit to exercise Response Queue reset. This bit will be cleared automatically once the Response Queue reset is completed.
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_QUEUE_RST</name>
	<description>Command Queue Software Reset.

Write 1'b1 to this bit to exercise Command Queue reset. This bit will the cleared automatically once the Command Queue reset is completed.
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SOFT_RST</name>
	<description>Core Software Reset.

Write 1'b1 to this bit to exercise software reset. This will reset all Buffers - Receive, Transmit, Command and Response This bit will be cleared automatically once the core reset is completed.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_RESPONSE_QUEUE_PORT_REG</name>
	<description>RESPONSE_QUEUE_PORT</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RESPONSE</name>
	<description>32 bit Response
</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_RX_TX_DATA_PORT_REG</name>
	<description>Receive and Transmit Data Port Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RX_TX_DATA_PORT</name>
	<description>Receive and Transmit Data Port. (Merged in Doxbox)

The Receive data port is mapped to the Rx-Data Buffer.

The Receive data is always packed in 4-byte aligned data words and stored in the Rx-Data Buffer. If the command length is not aligned to the 4-bytes, then the additional data bytes have to be ignored.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_EXT_LCNT_TIMING_REG</name>
	<description>SCL Extended Low Count Timing Register </description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x20202020</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I3C_EXT_LCNT_4</name>
	<description>I3C Extended Low Count Register 4

SDR4 uses this register field for data transfer.</description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_EXT_LCNT_3</name>
	<description>I3C Extended Low Count Register 3

SDR3 uses this register field for data transfer.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_EXT_LCNT_2</name>
	<description>I3C Extended Low Count Register 2

SDR2 uses this register field for data transfer.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_EXT_LCNT_1</name>
	<description>I3C Extended Low Count Register 1

SDR1 uses this register field for data transfer.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_EXT_TERMN_LCNT_TIME_REG</name>
	<description> SCL Termination Bit Low count Timing Register </description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I3C_EXT_TERMN_LCNT</name>
	<description>I3C Read Termination Bit Low count.

Extended I3C Read Termination Bit low count for I3C Read transfers. Effective Termination-Bit Low Period is derived based on the SDR speed as shown below

SDR0 speed: I3C_PP_LCNT + I3C_EXT_TERMN_LCNT
SDR1 speed: I3C_EXT_LCNT_1 + I3C_EXT_TERMN_LCNT
SDR2 speed: I3C_EXT_LCNT_2 + I3C_EXT_TERMN_LCNT
SDR3 speed: I3C_EXT_LCNT_3 + I3C_EXT_TERMN_LCNT
SDR4 speed: I3C_EXT_LCNT_4 + I3C_EXT_TERMN_LCNT</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I2C_FMP_TIMING_REG</name>
	<description>SCL I2C Fast Mode Plus Timing Register </description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00100010</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I2C_FMP_HCNT</name>
	<description>I2C Fast Mode Plus High Count

The SCL open-drain high count timing for I2C fast mode transfers.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_FMP_LCNT</name>
	<description>I2C Fast Mode Plus Low Count

