davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
When JDI-Parallel Interface is selected:
Bits Description
31 bit : Mute DPI outputs
30 bit : Mask DPIREADY input
29 bit : Reserved
28-26 bits : JDI HST width
25-23 bits : JDI HST offset
22-13 bits : JDI VST width
12-3 bits : JDI VST offset
2-0 bits : Reserved</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_FRONTPORCHXY_REG</name>
	<description>Front Porch X and Y</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>FPORCH_X</name>
	<description>Front porch X (pixel clocks)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FPORCH_Y</name>
	<description>Front porch Y (lines)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_GPIO_REG</name>
	<description>General Purpose IO (8-bits)</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DPI_CM_ASSERT</name>
	<description>Assert DPI-2 Color Mode signal</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DPI_SD_ASSERT</name>
	<description>Assert DPI-2 Shutdown signal</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>GPIO_SPI_SI_ON_SD_PAD</name>
	<description>Enable to have the SPI SI on the SPI SD pad</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GPIO_OUTPUT_MODE</name>
	<description>Select the mode that should be mapped on the GPIO pins
0x0 = JDI
0x1 = DPI
0x2 = DBI
0x3 = SPI</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GPIO_OUTPUT_EN</name>
	<description>Enable the GPIO pins for LCDC control. The GPIO_OUTPUT_MODE is used to define what LCDC pins will be mapped towards the GPIO pins.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TE_INV</name>
	<description>Applies an inversion on the TE (tearing effect) signal.
0 : the inversion is not applied on the TE signal
1 : the inversion is applied on TE signal</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_IDREG_REG</name>
	<description>Identification Register</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x87452365</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LCDC_ID</name>
	<description>Identification register</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_INTERRUPT_REG</name>
	<description>Interrupt Register</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>IRQ_TRIGGER_SEL</name>
	<description>IRQ trigger control
0: Level triggering
1: Edge triggering
In the case of the level triggering, the request remains active in the LCDC until to be cleared. The request can be cleared by performing a write access in the LCDC_INTERRUPT_REG. This is not required in the case of the edge triggering.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FE_IRQ_EN</name>
	<description>Frame end interrupt enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TE_IRQ_EN</name>
	<description>Tearing enable interrupt enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HSYNC_IRQ_EN</name>
	<description>HSYNC interrupt enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VSYNC_IRQ_EN</name>
	<description>VSYNC or TE interrupt enabled. See also the configuration bit LCDC_DBIB_CFG_REG[LCDC_DBIB_TE_DIS] for the TE signal.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_BASEADDR_REG</name>
	<description>Layer0 Base Addr</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L0_BASE_ADDR</name>
	<description>Base Address of the frame buffer</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_MODE_REG</name>
	<description>Layer0 Mode</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L0_EN</name>
	<description>Enable layer.
0 : disable
1 : enable</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_FORCE_ALPHA</name>
	<description>When set to 1, force alpha with global alpha</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_PREMUL_IMG_ALPHA</name>
	<description>When set to 1, premultiply image alpha is enabled</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_ASSERT_HLOCK_DMA</name>
	<description>When set to 1, HLOCK signal on AHB DMAs is asserted</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_ALPHA</name>
	<description>Alpha layer global value (0x00-0xFF range)</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_DST_BLEND</name>
	<description>Destinary Blending Function
0000: BLEND ZERO
0001: BLEND ONE
0010: BLEND ALPHA SRC
0011: BLEND ALPHA GBL
0100: BLEND ALPHA SRCGBL
0101: BLEND INV SRC
0110: BLEND INV GBL
0111: BLEND INV SRCGBL
1010: BLEND ALPHA DST
1101: BLEND INV DST</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_SRC_BLEND</name>
	<description>Source Blending Function
0000: BLEND ZERO
0001: BLEND ONE
0010: BLEND ALPHA SRC
0011: BLEND ALPHA GBL
0100: BLEND ALPHA SRCGBL
0101: BLEND INV SRC
0110: BLEND INV GBL
0111: BLEND INV SRCGBL
1010: BLEND ALPHA DST
1101: BLEND INV DST</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_COLOR_MODE</name>
	<description>Color Mode:
00001: 16-bit RGBX5551 color format,
00010: 32-bit RGBX8888 color format,
00100: 8-bit RGB332 color format,
00101: 16-bit RGB565 color format,
00110: 32-bit XRGB8888,
01101: ABGR8888,
01110: BGRA8888
others: reserved / not supported</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_RESXY_REG</name>
	<description>Layer0 Res XY</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L0_RES_X</name>
	<description>Resolution X (Resolution of layer in pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_RES_Y</name>
	<description>Resolution Y (Resolution of layer in pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_SIZEXY_REG</name>
	<description>Layer0 Size XY</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L0_SIZE_X</name>
	<description>Size X (Size of layer in pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_SIZE_Y</name>
	<description>Size Y (Size of layer in pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_STARTXY_REG</name>
	<description>Layer0 Start XY</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L0_START_X</name>
	<description>Start X (offset pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_START_Y</name>
	<description>Start Y (offset pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER0_STRIDE_REG</name>
	<description>Layer0 Stride</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L0_DMA_PREFETCH</name>
	<description>Specify the DMA prefetch Level in layer 0
* 0x000 : 0 DMA rows (default)
* 0x001 : 1 DMA row
* 0x010 : 2 DMA rows
* 0x011 : 3 DMA rows
* 0x100 : 4 DMA rows</description>
	<bitRange>[27:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_FIFO_THR</name>
	<description>Layer dma fifo threshold burst start
00: half fifo (default)
01: 2 burst size
10: 4 burst size
11: 8 burst size</description>
	<bitRange>[20:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_NO_16BEAT_BURST</name>
	<description>When set to 1 forbids INCR16 bursts in layer 0</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L0_STRIDE</name>
	<description>Layer Stride (distance from line to line in bytes)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER1_BASEADDR_REG</name>
	<description>Layer1 Base Addr</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1_BASE_ADDR</name>
	<description>Base Address of the frame buffer</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER1_MODE_REG</name>
	<description>Layer1 Mode</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1_EN</name>
	<description>Enable layer.
0 : disable
1 : enable</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_FORCE_ALPHA</name>
	<description>When set to 1, force alpha with global alpha</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_PREMUL_IMG_ALPHA</name>
	<description>When set to 1, premultiply image alpha is enabled</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_ASSERT_HLOCK_DMA</name>
	<description>When set to 1, HLOCK signal on AHB DMAs is asserted</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_ALPHA</name>
	<description>Alpha layer global value (0x00-0xFF range)</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_DST_BLEND</name>
	<description>Destinary Blending Function
0000: BLEND ZERO
0001: BLEND ONE
0010: BLEND ALPHA SRC
0011: BLEND ALPHA GBL
0100: BLEND ALPHA SRCGBL
0101: BLEND INV SRC
0110: BLEND INV GBL
0111: BLEND INV SRCGBL
1010: BLEND ALPHA DST
1101: BLEND INV DST
</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_SRC_BLEND</name>
	<description>Source Blending Function
0000: BLEND ZERO
0001: BLEND ONE
0010: BLEND ALPHA SRC
0011: BLEND ALPHA GBL
0100: BLEND ALPHA SRCGBL
0101: BLEND INV SRC
0110: BLEND INV GBL
0111: BLEND INV SRCGBL
1010: BLEND ALPHA DST
1101: BLEND INV DST
</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_COLOR_MODE</name>
	<description>Color Mode:
00001: 16-bit RGBX5551 color format,
00010: 32-bit RGBX8888 color format,
00100: 8-bit RGB332 color format,
00101: 16-bit RGB565 color format,
00110: 32-bit XRGB8888,
01101: ABGR8888,
01110: BGRA8888
others: reserved / not supported</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER1_RESXY_REG</name>
	<description>Layer1 Res XY</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1_RES_X</name>
	<description>Resolution X (Resolution of layer in pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_RES_Y</name>
	<description>Resolution Y (Resolution of layer in pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER1_SIZEXY_REG</name>
	<description>Layer1 Size XY</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1_SIZE_X</name>
	<description>Size X (Size of layer in pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_SIZE_Y</name>
	<description>Size Y (Size of layer in pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER1_STARTXY_REG</name>
	<description>Layer0 Start XY</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1_START_X</name>
	<description>Start X (offset pixels)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_START_Y</name>
	<description>Start Y (offset pixels)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_LAYER1_STRIDE_REG</name>
	<description>Layer1 Stride</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1_DMA_PREFETCH</name>
	<description>Specify the DMA prefetch Level in layer 1
* 0x000 : 0 DMA rows (default)
* 0x001 : 1 DMA row
* 0x010 : 2 DMA rows
* 0x011 : 3 DMA rows
* 0x100 : 4 DMA rows</description>
	<bitRange>[27:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_FIFO_THR</name>
	<description>Layer dma fifo threshold burst start
00: half fifo (default)
01: 2 burst size
10: 4 burst size
11: 8 burst size</description>
	<bitRange>[20:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_NO_16BEAT_BURST</name>
	<description>When set to 1 forbids INCR16 bursts in layer 1</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>L1_STRIDE</name>
	<description>Layer Stride (distance from line to line in bytes)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_MODE_REG</name>
	<description>Display Mode</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MODE_EN</name>
	<description>Mode register.
0 : disable
1 : enable</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VSYNC_POL</name>
	<description>VSYNC polarity.
0: positive
1: negative</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HSYNC_POL</name>
	<description>HSYNC polarity.
0: positive
1: negative</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DE_POL</name>
	<description>DE polarity.
0: positive
1: negative</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DITH_MODE</name>
	<description>0x00: Dithering is disabled
0x01: Dithering 18-bits mode
0x02: Dithering 16-bits mode
0x03: Dithering 15-bits mode</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VSYNC_SCPL</name>
	<description>Set VSYNC for a single cycle per line.
0: disable
1: enable</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PIXCLKOUT_POL</name>
	<description>Pixel clock out polarity.
0: positive
1: negative</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GLOBAL_GAMMA_EN</name>
	<description>When set to 1, global gamma correction is enabled</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_BLANK</name>
	<description>Forces output to blank.
0: disable
1: enable</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UNDERRUN_PREVENTION_EN</name>
	<description>When set to 1, underrun prevention is enabled for interfaces that support this</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SFRAME_UPD</name>
	<description>Single frame update.
0: disable
1: enable</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DPI2_CONFIG</name>
	<description>Defines MIPI DPI-2 Configuration
0x00: RGB888 24-bits
0x01: RGB666 18-bits Configuration 1
0x02: RGB666 18-bits Configuration 2
0x03: RGB565 16-bits Configuration 1
0x04: RGB565 16-bits Configuration 2
0x05: RGB565 16-bits Configuration 3
0x06: Reserved
0x07: Reserved</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PIXCLKOUT_SEL</name>
	<description>Selects the pixel out clock for the display.
0: based on the pixel pipeline clock
1: based on the format pipeline clock
See also the LCDC_CLKCTRL_REG.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_MODE</name>
	<description>Selection of the output mode
0000: Parallel RGB
1000: JDI MIP
All the other values are reserved.</description>
	<bitRange>[8:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DBIB_OFF</name>
	<description>When set to 0, DBI Type-B interface is enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORM_OFF</name>
	<description>Formating off
0: disabled
1: enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DSCAN</name>
	<description>Double horizontal scan
0: disabled
1: enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMODE</name>
	<description>Test mode
0: disabled
1: enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_PALETTE_255</name>
	<description>Global palette/gamma correction</description>
	<addressOffset>0x000007fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PALLETE_R</name>
	<description>Gamma ramp red bits</description>
	<bitRange>[23:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PALLETE_G</name>
	<description>Gamma ramp green bits</description>
	<bitRange>[15:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PALLETE_B</name>
	<description>Gamma ramp blue bits</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>LCDC_PALETTE_BASE</name>
	<description>Global palette/gamma correction</description>
	<addressOffset>0x00000400</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PALLETE_R</name>
	<description>Gamma ramp red bits</description>
	<bitRange>[23:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PALLETE_G</name>
	<description>Gamma ramp green bits</description>
	<bitRange>[15:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PALLETE_B</name>
	<description>Gamma ramp blue bits</description>
	<bitRange>[7:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>LCDC_RESXY_REG</name>
	<description>Resolution X,Y</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RES_X</name>
	<description>Resolution X in pixels.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RES_Y</name>
	<description>Resolution Y in pixels.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_STARTXY_REG</name>
	<description>Specifies the start position of the very first frame</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>START_X</name>
	<description>Specify framess X dimension</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>START_Y</name>
	<description>Specify framess Y dimension</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_STATUS_REG</name>
	<description>Status Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SPI_RD_WR_OP</name>
	<description>Indicates read/write operation on SPI</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBIB_CMD_FIFO_FULL</name>
	<description>Indicates if the command FIFO is full</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBI_SPI_CS</name>
	<description>Indicates DBI/SPI CS status</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FRAME_END</name>
	<description>Frame end (active high)</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBIB_OUT_TRANS_PENDING</name>
	<description>Pending output transaction in DBI Type-B interface</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBIB_CMD_PENDING</name>
	<description>Transferring of command in progress.
0: idle
1: in progress</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBIB_DATA_PENDING</name>
	<description>Pending RGB data in DBI Type-B interface</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBIB_TE</name>
	<description>The DBIB tearing effect signal</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>STICKY_UNDERFLOW</name>
