davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PDC_PENDING</name>
	<description>Indicates which IRQ ids are pending</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>PDC_PENDING_SNC_REG</name>
	<description>Shows any pending IRQ to SNC</description>
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PDC_PENDING</name>
	<description>Indicates which IRQ ids are pending towards the SensorNodeController</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>PDC_SET_PENDING_REG</name>
	<description>Set a pending PDC bit</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>PDC_SET_PENDING</name>
	<description>Writing to this field sets the PDC wake-up request and IRQ.
The data controls which request is acknowledged</description>
	<bitRange>[4:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>PWMLED</name>
	<version>1.0</version>
	<description>PWMLED registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010600</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>LED1_PWM_CONF_REG</name>
	<description>Defines duty cycle and load sel for LED1</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PWMLED_START_CYCLE</name>
	<description>Defines the cycle at which the PWM becomes high. Setting start_cycle = stop_cycle results in 100% duty cycle</description>
	<bitRange>[23:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWMLED_STOP_CYCLE</name>
	<description>Defines the cycle at which the PWM becomes low. Setting start_cycle = stop_cycle results in 100% duty cycle</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LED2_PWM_CONF_REG</name>
	<description>Defines duty cycle and load sel for LED2</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PWMLED_START_CYCLE</name>
	<description>Defines the cycle at which the PWM becomes high. Setting start_cycle = stop_cycle results in 100% duty cycle</description>
	<bitRange>[23:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWMLED_STOP_CYCLE</name>
	<description>Defines the cycle at which the PWM becomes low. Setting start_cycle = stop_cycle results in 100% duty cycle</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LED3_PWM_CONF_REG</name>
	<description>Defines duty cycle and load sel for LED3</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PWMLED_START_CYCLE</name>
	<description>Defines the cycle at which the PWM becomes high. Setting start_cycle = stop_cycle results in 100% duty cycle</description>
	<bitRange>[23:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWMLED_STOP_CYCLE</name>
	<description>Defines the cycle at which the PWM becomes low. Setting start_cycle = stop_cycle results in 100% duty cycle</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LEDS_DRV_CTRL_REG</name>
	<description>LED driver control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>LED3_EN</name>
	<description>0 = LED disabled, 1 = LED enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED2_EN</name>
	<description>0 = LED disabled, 1 = LED enabled </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED1_EN</name>
	<description>0 = LED disabled, 1 = LED enabled </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LEDS_FREQUENCY_REG</name>
	<description>Defines the frequency of all the LEDs</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fff</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>PWM_LEDS_PRESCALE</name>
	<description>Defines the clock prescaler that is used for the input clock for PWM LED1-3.
Division factor = register value + 1
0x00: Divide by 1
0x01: Divide by 2
0x02: Divide by 3
...
...
0xFE: Dvide by 255
0xFF: Divide by 256</description>
	<bitRange>[19:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWM_LEDS_PERIOD</name>
	<description>Defines the period of PWM signals 1-3. Period = Period constant system clock * ((PWMLED_MAX_PERIOD+1 ) * (PWMLED_PRESCALE+1))</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LEDS_PWM_CTRL_REG</name>
	<description>LED PWM control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>PWM_LEDS_HW_PAUSE_ENABLE</name>
	<description>When this bit is set, PWM engines 1-3 are paused when the radio enable is high</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWM_LEDS_SW_PAUSE</name>
	<description>PWM engines1-3 are paused when this bit is set by SW</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED3_PWM_ENABLE</name>
	<description>Enables/Disables the PWM engine</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED2_PWM_ENABLE</name>
	<description>Enables/Disables the PWM engine</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED1_PWM_ENABLE</name>
	<description>Enables/Disables the PWM engine</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LEDS_STATUS_REG</name>
	<description>LEDS status register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>LED_FREQUENCY_BUSY</name>
	<description>LEDS_FREQUENCY_REG is busy with synchronisation. Wait unti this bit is 0 before writing a new value</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LED3_CONF_BUSY</name>
	<description>LED3_CONF_REG is busy with synchronisation. Wait unti this bit is 0 before writing a new value</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LED2_CONF_BUSY</name>
	<description>LED2_CONF_REG is busy with synchronisation. Wait unti this bit is 0 before writing a new value</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LED1_CONF_BUSY</name>
	<description>LED1_CONF_REG is busy with synchronisation. Wait unti this bit is 0 before writing a new value</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LED_CURR_TRIM_REG</name>
	<description>Trim values for LEDS</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>LED3_CURR_TRIM</name>
	<description>LED current trimming</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED2_CURR_TRIM</name>
	<description>LED current trimming</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED1_CURR_TRIM</name>
	<description>LED current trimming</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LED_LOAD_SEL_REG</name>
	<description>Load sel for LEDS</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001ff</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>LED3_LOAD_SEL</name>
	<description>Defines LED sinking current: 2.5 mA + (LED_LOAD_SEL*2.5 mA). Max = 20 mA</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED2_LOAD_SEL</name>
	<description>Defines LEDsinking current: 2.5 mA + (LED_LOAD_SEL*2.5 mA). Max = 20 mA</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED1_LOAD_SEL</name>
	<description>Defines LED sinking current: 2.5 mA + (LED_LOAD_SEL*2.5 mA). Max = 20 mA</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QSPIC</name>
	<version>1.0</version>
	<description>QSPIC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x46000000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>72</size>
	<usage>registers</usage>
</addressBlock>
	
