davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_HR_U</name>
	<description>Hours units. Represented in BCD digit (0-9).</description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_M_T</name>
	<description>Minutes tens. Represented in BCD digit (0-5).</description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_M_U</name>
	<description>Minutes units. Represented in BCD digit (0-9).</description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_S_T</name>
	<description>Seconds tens. Represented in BCD digit (0-9).</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_S_U</name>
	<description>Seconds units. Represented in BCD digit (0-9).</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_H_T</name>
	<description>Hundredths of a second tens. Represented in BCD digit (0-9).</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RTC_TIME_H_U</name>
	<description>Hundredths of a second units. Represented in BCD digit (0-9).</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SDADC</name>
	<version>1.0</version>
	<description>SDADC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040500</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>24</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>SDADC_AUDIO_FILT_REG</name>
	<description>Sigma Delta ADC Audio Filter Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>SDADC_CIC_OFFSET</name>
	<description>Constant CIC offset</description>
	<bitRange>[20:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_CLEAR_INT_REG</name>
	<description>Sigma Delta ADC Clear Interrupt Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SDADC_CLR_INT</name>
	<description>Writing any value to this register will clear the ADC_INT interrupt. Reading returns 0. </description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SDADC_CTRL_REG</name>
	<description>Sigma Delta ADC Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000800</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>SDADC_DMA_EN</name>
	<description>0: DMA functionality disabled
1: DMA functionality enabled</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_MINT</name>
	<description>0: Disable (mask) SDADC_ADC_INT.
1: Enable SDADC_ADC_INT to ICU.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INT</name>
	<description>1: AD conversion ready and has generated an interrupt. Must be cleared by writing any value to SDADC_CLEAR_INT_REG.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDADC_LDO_OK</name>
	<description>1: Internal LDO is ready for use</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDADC_AUDIO_FILTER_EN</name>
	<description>0: Disable audio filter, ADC is forced into reset. When setting to 0 while SDADC_START = 1, the last sample is completed first before disabling.
1: Enable the audio filter, this bit needs to be set before the SDADC_START bit is set to 1.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_RESULT_MODE</name>
	<description>Sample mode
0: Sample extention, SDADC_RESULT_REG = {sample[15:2], sample[2], sample[2]}
1: Sample truncation, SDADC_RESULT_REG = {0x00, sample[15:8]}
2: Normal mode, SDADC_RESULT_REG = sample[15:0]
3: N.A.</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_START</name>
	<description>0: ADC idle
1: Start ADC</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_EN</name>
	<description>0: LDO is off and ADC is disabled.
1: LDO, bias currents and modulator are enabled.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_PGA_CTRL_REG</name>
	<description>Sigma Delta ADC PGA Control Registers</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>PGA_GAIN</name>
	<description>select the PGA gain select:
0 : -12 dB
1 : -6 dB
2 : 0 dB
3 : 6 dB
4 : 12 dB
5 : 18 dB
6 : 24 dB
7 : 30 dB</description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_MODE</name>
	<description>Use PGA in single ended mode
0 : Differential mode (default)
1 : Use N-branch as single ended mode
2 : Differential mode
3 : Use P-branch as single ended mode</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_MUTE</name>
	<description>Mute the PGA output
0 : Unmuted (default)
1 : Mute</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_BIAS</name>
	<description>Configure the PGA bias control:
0: 0.40 x Ibias
1: 0.44 x Ibias
2: 0.50 x Ibias
3: 0.57 x Ibias
4: 0.66 x Ibias
5: 0.80 x Ibias
6: 1.00 x Ibias
7: 1.33 x Ibias</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_SHORTIN</name>
	<description>PGA input short
0 : Normal mode (default)
1 : Short PGA inputs</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_EN</name>
	<description>PGA enable:
00: both branches of PGA disabled
01: Positive branch of PGA enabled, Negative branch disabled
10: Positive branch of PGA disabled, Negative branch enabled
11: Both branches of PGA enabled</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_RESULT_REG</name>
	<description>Sigma Delta ADC Result Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SDADC_VAL</name>
	<description>Returns 16 bits linear value of the last AD conversion. </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SNC</name>
	<version>1.0</version>
	<description>SNC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50021000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>8</size>
	<usage>registers</usage>
</addressBlock>
	
