davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<registers>
	<register>
	<name>SNC_STATUS_REG</name>
	<description>Sensor Node Status Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>WDOG_EARLY_NOTICE</name>
	<description>0 = Normal operation
1 = Indicates that the SNC Watchdog counter has reached the value 16, while down-counting from the value programmed. This bit is automatically cleared as soon as the Watchdog expires.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WDOG_HAS_EXPIRED</name>
	<description>0 = Normal operation
1 = Indicates that the SNC Watchdog counter has expired</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CPU_LOCKED</name>
	<description>0 = Normal operation
1 = SNC CPU is locked-up. The specific bit-field is set as soon as the corresponding LOCKUP output of the processor is set.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CPU_IDLE</name>
	<description>0 = Normal operation
1 = SNC CPU is in idle mode, activated when the 'sleeping' bit of Cortex M0+ is set (for instance, when waiting for an interrupt).</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CPU_HALTED</name>
	<description>0 = Normal operation
1 = SNC CPU is halted</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SNC_WDOG_REG</name>
	<description>Sensor Node Watchdog Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001fff</resetValue>
	<resetMask>0xf80fffff</resetMask>
	<fields><field>
	<name>SYS2SNC_WDOG_FREEZE</name>
	<description>This bit-field returns a read-only copy of SET_FREEZE_REG-&gt;FRZ_SNC_WDOG value.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS2SNC_WDOG_FREEZE_DIS</name>
	<description>If 1, it mask the SYS2SNC_WDOG_FREEZE, which is provided by SET_FREEZE_REG[FRZ_SNC_WDOG].
Setting this field to 1 can be done only by writing ones to the field SNC_WDOG_WRITE_VALID at the same time.
The field can only be set to 1, so it can be set during the initilization and it will not change during the reloadings.
The asynchronous reset is connected to the SNC CPU reset.</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC_WDOG_EXPIRE</name>
	<description>This bit automatically set to 1 as soon as SNC_WDOG_CNT = 0, causing:
a) The SNC_WDOG_CNT to start down-counting again, now beginning from the value of 16.
b) The assertion of SNC_STATUS_REG[WDOG_HAS_EXPIRED], indicating that the SNC Watchdog has expired.
If SW writes SNC_WDOG_EXPIRE = 0 and SNC_WDOG_CNT = 0, at the next WDOG clock cycle the SNC_WDOG_EXPIRE will automatically be set to 1.
If SW writes SNC_WDOG_EXPIRE = 1 and SNC_WDOG_CNT = 0, at the next WDOG clock cycle SNC_WDOG_SYS_RST_REQ will be automatically set to 1.
The SNC_WDOG_SYS_RST_REQ will reset the system and will also update the RESET_STAT_REG[SNC_WDOGRESET_STAT].</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC_WDOG_SYS_RST_REQ</name>
	<description>Refer to the SNC_WDOG_EXPIRE bit-field.</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SNC_WDOG_WRITE_VALID</name>
	<description>To allow a write of any remaining fields, this value must also be written simultaneously with the value 3 and perform 32-bit write access. Reading this field will always return 0..</description>
	<bitRange>[18:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>SNC_WDOG_CNT</name>
	<description>Provides access to the counter, which counts down every 10.24 ms.
FW should reload the WDOG counter by writing the value (SNC_WDOG_CNT | SNC_WDOG_WRITE_VALID) to SNC_WDOG_REG, which means, write can be done only by writing SNC_WDOG_WRITE_VALID with 1s at the same time.
The counter will start counting immediately after the power-up of the power domain and will reset on every SNC CPU reset.</description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SPI</name>
	<version>1.0</version>
	<description>SPI registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>48</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>SPI_CLOCK_REG</name>
	<description>Spi clock register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>SPI_CLK_DIV</name>
	<description>Applicable only in master mode
Defines the spi clock frequency in master only mode
SPI_CLK = module_clk / 2*(SPI_CLK_DIV+1) when SPI_CLK_DIV not 0x7F
if SPI_CLK_DIV=0x7F then SPI_CLK=module_clk</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_CONFIG_REG</name>
	<description>Spi control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI_SLAVE_EN</name>
	<description>0 = SPI module master mode
1 = SPI module slave mode
</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_WORD_LENGTH</name>
	<description>Define the spi word length = 1+ SPI_WORD_LENGTH (range 4 to 32)
Note: should be changed with SPI_EN=0</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_MODE</name>
	<description>Define the spi mode (CPOL, CPHA)
0 = new data on falling, capture on rising, clk low in idle state
1 = new data on rising, capture on falling, Clk low in idle state
2 = new data on rising, capture on falling, Clk high in idle state
3 = new data on falling, capture on rising Clk high in idle state
</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_CS_CONFIG_REG</name>
	<description>Spi cs configuration register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>SPI_CS_SELECT</name>
	<description>Control the cs output in master mode
0 = none slave device selected
1 = selected slave device connected to GPIO with FUNC_MODE=SPI_CS0
2 = selected slave device connected to GPIO with FUNC_MODE=SPI_CS1
4 = selected slave device connected to GPIO with FUNC_MODE=GPIO</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_CTRL_REG</name>
	<description>Spi control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI_SWAP_BYTES</name>
	<description>0 = normal operation
1 = LSB and MSB are swaped in APB interface
In case of 8-bit spi interface, DMA/SPI can be configured in 16-bit mode to off load the bus. Enabling SPI_SWAP_BYTES bytes will read/wrte correctly</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CAPTURE_AT_NEXT_EDGE</name>
	<description>0 = SPI captures data at correct clock edge
1 = SPI captures data at next clock edge. (only for Master mode and high clock)</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_FIFO_RESET</name>
	<description>0 = Fifo normal operation
1 = Fifo in reset state
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_DMA_RX_EN</name>
	<description>Applicable only when SPI_RX_EN=1
0 = No DMA request for RX
1 = DMA request when SPI_STATUS_RX_FULL=1</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_DMA_TX_EN</name>
	<description>Applicable only when SPI_TX_EN=1
0 = No DMA request for TX
1 = DMA request when SPI_STATUS_TX_EMPTY=1</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_RX_EN</name>
	<description>0 = RX path is disabled
1 = RX path is enabled
Note: if spi mode=1 or spi mode=3 readonly is not supported</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_TX_EN</name>
	<description>0 = TX path is disabled
1 = TX path is enabled
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_EN</name>
	<description>0 = SPI module is disable
1 = SPI module is enable
</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_CONFIG_REG</name>
	<description>Spi fifo configuration register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_RX_TL</name>
	<description>Receive FIFO threshold level in bytes. Control the level of bytes in fifo that triggers the RX_FULL interrupt. IRQ is occurred when fifo level is more or equal to SPI_RX_TL+1. Valid FIFO level is from 0 to 32</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_TX_TL</name>
	<description>Transmit FIFO threshold level in bytes. Control the level of bytes in fifo that triggers the TX_EMPTY interrupt. IRQ is occurred when fifo level is less or equal to SPI_TX_TL. Valid FIFO level is from 0 to 32</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_READ_REG</name>
	<description>Spi RX fifo read register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SPI_FIFO_READ</name>
	<description>Read from RX fifo. Read access is permit only if SPI_RX_FIFO_EMPTY=0. </description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_STATUS_REG</name>
	<description>SPI RX/TX fifo status register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SPI_TRANSACTION_ACTIVE</name>
	<description>In master mode
0 = spi transaction is inactive
1 = spi transaction is active</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_RX_FIFO_OVFL</name>
	<description>When 1, receive data is not written to fifo because fifo was full and interrupt is generated. It clears with SPI_CTRL_REG.SPI_FIFO_RESET
</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_STATUS_TX_FULL</name>
	<description>0 = TX fifo is not full
1 = TX fifo is full
</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_STATUS_RX_EMPTY</name>
	<description>0 = RX fifo is not empty
1 = RX fifo is empty
</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_TX_FIFO_LEVEL</name>
	<description>Gives the number of bytes in TX fifo</description>
	<bitRange>[11:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_RX_FIFO_LEVEL</name>
	<description>Gives the number of bytes in RX fifo</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SPI_FIFO_WRITE_REG</name>
	<description>Spi TX fifo wtite register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SPI_FIFO_WRITE</name>
	<description>Write to TX fifo. Write access is permit only if SPI_TX_FIFO_FULL is 0</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SPI_IRQ_MASK_REG</name>
	<description>Spi interrupt mask register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SPI_IRQ_MASK_RX_FULL</name>
	<description>0 = FIFO RX full irq is masked
1 = FIFO RX full irq is enabled
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_IRQ_MASK_TX_EMPTY</name>
	<description>0 = FIFO TX empty irq is masked
1 = FIFO TX empy irq is enabled
</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SPI_STATUS_REG</name>
	<description>Spi status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SPI_STATUS_RX_FULL</name>
	<description>Auto clear
0 = RX fifo level is less than SPI_RX_TL+1
1 = RX fifo level is more or equal to SPI_RX_TL+1
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPI_STATUS_TX_EMPTY</name>
	<description>Auto clear
0 = TX fifo level is larger than SPI_TX_TL
1 = TX fifo level is less or equal to SPI_TX_TL
</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SPI_TXBUFFER_FORCE_REG</name>
	<description>SPI TX buffer force low value</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SPI_TXBUFFER_FORCE</name>
	<description>Write directly the tx buffer . It must to be used only in slave mode</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SPI2</name>
	<version>1.0</version>
	<description>SPI2 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>48</size>
	<usage>registers</usage>
</addressBlock>
	
