davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
NOTE: only change this bit when timer is disabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_ONESHOT_MODE_EN</name>
	<description>Timer mode
1 = One shot enabled
0 = Counter enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_EN</name>
	<description>Timer enable
1 = On
0 = Off</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_GPIO1_CONF_REG</name>
	<description>Timer gpio1 selection</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_GPIO1_CONF</name>
	<description>Select one of the 32 GPIOs as IN1, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_GPIO2_CONF_REG</name>
	<description>Timer gpio2 selection</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_GPIO2_CONF</name>
	<description>Select one of the 32 GPIOs as IN2, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_PRESCALER_VAL_REG</name>
	<description>Timer prescaler counter value</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_PRESCALER_VAL</name>
	<description>Gives the current prescaler counter value</description>
	<bitRange>[4:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER5_PULSE_CNT_CTRL_REG</name>
	<description>Timer pulse counter ctrl register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>PULSE_CNT_GPIO_SEL</name>
	<description>Select one of the 32 GPIOs as input for the pulse counter, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17

NOTE: Only change this when EDGE_DET_CNT_EN=0 in TIMER_CTRL_REG</description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PULSE_CNT_THRESHOLD</name>
	<description>Select after how many pulses an irq is fired for the pulse counter

NOTE: Only change this when EDGE_DET_CNT_EN=0 in TIMER_CTRL_REG</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_PWM_CTRL_REG</name>
	<description>Timer pwm frequency register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_PWM_DC</name>
	<description>Defines the PWM duty cycle. TIM_PWM_DC / ( TIM_PWM_FREQ+1)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_PWM_FREQ</name>
	<description>Defines the PWM frequency. Timer clock frequency / (TIM_PWM_FREQ+1)
Timer clock is clock after prescaler</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_SETTINGS_REG</name>
	<description>Timer reload value and Delay in shot mode</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_PRESCALER</name>
	<description>Defines the timer count frequency. CLOCK frequency / (TIM_PRESCALER+1)</description>
	<bitRange>[28:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_RELOAD</name>
	<description>Reload or max value in timer mode, Delay phase duration in oneshot mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_SHOTWIDTH_REG</name>
	<description>Timer Shot duration in shot mode</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_SHOTWIDTH</name>
	<description>Shot phase duration in oneshot mode</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER5_STATUS_REG</name>
	<description>Timer status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>TIM_IRQ_PULSE_STATUS</name>
	<description>Status bit of IRQ pulse counter. When the pulse counter reaches the theshold value, this bit is 1</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_SWITCHED_TO_DIVN_CLK</name>
	<description>Indicates that timer clock has been switched to divn clock</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_PWM_BUSY</name>
	<description>Busy with synchronizing PWM_FREQ_REG and PWM_DC_REG. Do not write a new value to these registers when this bit is high.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_TIMER_BUSY</name>
	<description>Busy with synchronizing PRESCALER_REG, RELOAD_REG and SHOTWIDTH_REG. Do not write a new value to these registers when this bit is high.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IRQ_STATUS</name>
	<description>IRQ status bit. When an irq has occured, this bit is 1.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_ONESHOT_PHASE</name>
	<description>OneShot phase
0 = Wait for event
1 = Delay phase
2 = Start Shot
3 = Shot phase</description>
	<bitRange>[3:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IN2_STATE</name>
	<description>Gives the logic level of the IN1</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IN1_STATE</name>
	<description>Gives the logic level of the IN2</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER5_TIMER_VAL_REG</name>
	<description>Timer counter value</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_TIMER_VALUE</name>
	<description>Gives the current timer value</description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER6</name>
	<version>1.0</version>
	<description>TIMER6 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010500</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>92</size>
	<usage>registers</usage>
</addressBlock>
	
