davr/da1470x-sdk/config/embsys/Dialog_Semiconductor/DA1470x-00.xml
	<name>USB_XCV_TXn</name>
	<description>With Bit3,0 = 1, this bit sets USB_Dm to a high level, independent of LSMODE selection </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USB_XCV_TXp</name>
	<description>With Bit3,0 = 1, this bit sets USB_Dp to a high level, independent of LSMODE selection </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USB_XCV_TEST</name>
	<description>Enable USB_XCVDIAG_REG
0: Normal operation, test bits disabled
1: Enable test bits 7,6,5,3,2,1</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>VAD</name>
	<version>1.0</version>
	<description>VAD registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000c00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>VAD_CTRL0_REG</name>
	<description>VAD Control Register 0</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000064</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>VAD_VTRACK</name>
	<description>Voice Tracking parameter:
This parameter allows to set the adaptation speed of the system depending on the voice input. When the setting of this parameter is low, the high-frequency sensitivity of the VAD increases, some phonem can be detected easily but high-frequency ambient noise can be considered as voice. When the setting of this parameter is high, the high-frequency sensitivity of the VAD decreases, high-frequency ambient noise is filtered but some phonem can be lost.
00: fast
01: default
. . .
11: slow</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VAD_NTRACK</name>
	<description>Background Noise Tracking parameter:
This parameter allows to set the speed of the system adaptation to the ambient noise. This parameter gives the flexibility to adapt the VAD to the application environment.
000: fast
. . .
100: default
. . .
111: slow</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VAD_PWR_LVL_SNSTVTY</name>
	<description>Power Level Sensitivity:
Ratio between ambient noise and voice level to be detected. When the setting of this parameter is low, the VAD sensitivity increases, leading to higher VDV and possibly higher NDV. When the setting of this parameter is high, the VAD sensitivity decreases, leading to lower NDV and possibly lower VDV.
000: 2 dB
001: 3 dB
010: 4 dB
011: 5 dB
100: 6 dB (default)
101: 8 dB
110: 10 dB
111: 16 dB</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VAD_CTRL1_REG</name>
	<description>VAD Control Register 1</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>VAD_MINDELAY</name>
	<description>Minimum Delay:
This parameter allows to set the minimum time before a detection when switching to Always listenning mode. This delay is defined as a number of clock cycle, divided from MCLK depending on MCLK_DIV setting.
00: 768 clock cycles (default)
01: 1536 clock cycles
10: 3584 clock cycles
11: 9632 clock cycles</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VAD_MINEVENT</name>
	<description>Minimum Event Duration:
This parameter allows to set the Minimum vocal signal duration that can be detected by the system. When the setting of this parameter is low, the detection latency decreases but the high-frequency ambient noise can be considered as voice. When the setting of this parameter is high, the high-frequency ambient noise is filtered but the detection latency increase. This delay is defined as a number of clock cycle, divided from MCLK depending on MCLK_DIV setting.
000: 1 Mclk cycle
001: 16 Mclk cycles
010: 32 Mclk cycles (default)
011: 64 Mclk cycles
100: 128 Mclk cycles
101: 256 Mclk cycles
110: 512 Mclk cycles
111: 1024 Mclk cycles</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VAD_CTRL2_REG</name>
	<description>VAD Control Register 2</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000027</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>VAD_NFI_DET</name>
	<description>NFI Detection: This parameter defines the NFI threshold above which an IRQ is sent</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VAD_CTRL3_REG</name>
	<description>VAD Control Register 3</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c0</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>VAD_SB</name>
	<description>Stand-by mode
0: The VAD block is activated (sleep or listening mode)
1: The VAD block is deactivated (stand-by mode)</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VAD_SLEEP</name>
	<description>Sleep mode
0: If SB = 0, The VAD block is in listening mode
1: If SB = 0, The VAD block is in sleep mode

Note: It is recommended to set VAD_SLEEP to 1 (sleep mode), during the recording of AIP/AIN audio inputs on ADC path. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VAD_MCLK_DIV</name>
	<description>Clock selection - refer to table 3.3*
000: Division ration = 1
001: Division ration = 2
010: Division ration = 4
011: Division ration = 8
100: Division ration = 16
101: Division ration = 24
110: Division ration = 48</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VAD_CTRL4_REG</name>
	<description>VAD Control Register 4</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>VAD_IRQ_MODE</name>
	<description>IRQ mode selection
0: The generated IRQ is a high level
1: The generated IRQ is a pulse, which duration
is 8 internal clock cycles</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VAD_IRQ_FLAG</name>
	<description>Interrupt ReQuest flag: IRQ_FLAG is set to 1
when a voice detection event occurs. Writing 1
resets the flag and the IRQ to 0.
Note:
Due to way the VAD is implemented, the delay for the IRQ clearance mechanism is depending on the input voice signal. In order to force the IRQ to '0' for cases of false trigger, the SLEEP mode of the VAD should be used (VAD_CTRL3_REG[SLEEP]).</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VAD_STATUS_REG</name>
	<description>VAD Status Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000028</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>VAD_NFI_RD</name>
	<description>VAD NFI output read-out value.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>WAKEUP</name>
	<version>1.0</version>
	<description>WAKEUP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000900</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>80</size>
	<usage>registers</usage>
</addressBlock>
	
